[
  {
    "title": "Little Kitchen Academy Bridgeport Village",
    "address": "7443 SW Bridgeport Road",
    "lat": 45.53250891635287,
    "long": -122.70261944420054,
    "link": "https://pdxparent.com/directory/little-kitchen-academy-bridgeport-village/",
    "website": "https://littlekitchenacademy.com/portland/",
    "facebook": "https://www.facebook.com/LKAPortlandBridgeportVillage/",
    "instagram": "https://www.instagram.com/lkaportlandbridgeportvillage/",
    "description": "Enjoy $50 toward a Fall Session!  Use code: HARVEST\n\nSeasonal sessions run year-round and are organized by age group (ages 3-5, 6-8, 9-12, and 13+ years old). Students experience a 3-hour class once a week during the school year or over five consecutive days during Summer, Winter, & Spring breaks. In each class, students learn how to make healthy, delicious and seasonal meals from scratch to consumption — all while experimenting with math and science concepts, working on their reading skills, and polishing up their table manners by sharing meals around the LKA community table (made with more than 33,000 recycled chopsticks).\n\nAs warm summer days give way to the crisp, fresh air of Fall and the leaves change from green to gold, we know that the harvest season has begun. In Fall, Mother Nature provides us with delicious fresh vegetables like squash, pumpkins, corn, and carrots. This bounty of fresh, colorful vegetables inspires our students to try new foods that they never knew they liked!\n\nOur Fall Season is a time of delight and exploration as our students try new recipes filled with fresh, local, seasonal vegetables. The weather may begin to get colder, but inside Little Kitchen Academy every day is full of warmth and joy as your child learns practical life skills that will last a lifetime.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/08/Fall.png",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "Topaz Farm on Sauvie Island",
    "address": "17100 NW Sauvie Island Rd",
    "lat": 45.6432796379392,
    "long": -122.8219564303308,
    "link": "https://pdxparent.com/directory/topaz-farm-on-sauvie-island/",
    "website": "http://topazfarm.com",
    "facebook": "https://www.facebook.com/TopazFarmPDX",
    "instagram": "https://www.instagram.com/topazfarm/",
    "description": "Topaz Farm is a family farm for all families! We're first-generation farmers, but our three-generation family operates the 130 acre, no-spray and regenerative farm with lots of activities for kids and families including:\n\nDozens of animals including mini-donkeys, mini-goats, pigs, runner ducks and more.\nU-pick berries and u-cut flowers\nThe island's first and only sunflower festival and maze\nFarm to Plate picnics\nHarvest festivals featuring live music\nThe island's largest farm stand, featuring house-made kid (and adult!) food, drinks and snacks\nAn outdoor bar and grill\nFall harvest activities including a huge corn maze, hay rides and pumpkin patches\n\nWith our on-site parter, the non-profit Sauvie Island Center, we're able to host summer and school break camps, workshops and volunteer days for kids and adults throughout the year.\n\nMany of our special events are by pre-order or reservation-only, so be sure to sign up for our email newsletter on our website or follow us on social media for all the latest announcements.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/04/logotrapezoid_blk_small.png",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "North Clackamas Parks & Recreation Department",
    "address": "5440 Southeast Kellogg Creek Drive, Milwaukie, OR, USA",
    "lat": 45.6432796379392,
    "long": -122.8219564303308,
    "link": "https://pdxparent.com/directory/north-clackamas-parks-recreation-department/",
    "website": "http://ncprd.com/summer-camps",
    "facebook": "https://www.facebook.com/NCPRD/",
    "instagram": "https://www.instagram.com/ncprd/",
    "description": "NCPRD offers a wide variety of affordable day camps to keep kids of all ages active and having fun all summer long. Choose from science, nature, dance, horseback riding, theater, science, track and field, lacrosse, tennis, pull-the-flag football and more. Full day camps and disability-inclusive options are available. See the full schedule at ncprd.com/summer-camps. Registration opens April 12.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/03/DSCF9447_summer_sm.jpg",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "Summer at OES",
    "address": "6300 Southwest Nicol Road, Portland, OR, USA",
    "long": -122.75603011244519,
    "lat": 45.47517462026698,
    "link": "https://pdxparent.com/directory/summer-at-oes/",
    "description": "In-person camps for ages 4-17. STEAM Crafting, Skateboarding Camp, Welcome to Audio Blast, Columbia River Gorge Wonders and more. Visit www.oes.edu/summer.",
    "images": []
  },
  {
    "title": "Camp Wa-Ri-Ki",
    "address": "17051 Washougal River Road, Washougal, WA, USA",
    "long": -122.75603011244519,
    "lat": 45.47517462026698,
    "link": "https://pdxparent.com/directory/camp-wa-ri-ki/",
    "website": "http://www.campwariki.com",
    "facebook": "https://www.facebook.com/campwarikifun/",
    "instagram": "https://www.instagram.com/kiwaniswariki/",
    "description": "Fun! That’s what is waiting for campers of all ages this year at Camp Wa-Ri-Ki!\n\nKiwanis Camp Wa-Ri-Ki, located in Washougal, Skamania County, Washington is 18+ acres of beautiful land in the heart of the Gifford Pinchot National Forest. It is our mission to provide an outdoor experience that offers optimal development of at-risk youth and our communities through recreational, educational and leadership opportunities. We offer programs in four categories: Nature-based Learning; Leadership and Personal Development; Fun, Exploration and Adventure and Outdoor Skills. Many camp activities integrate with local school’s STEM and STEAM curriculum.\n\nNASA’s GLOBE Goes to Camp\n\nOur programs are available by age group to allow peer-learning, appropriate outcome measures and to ensure safety of participants. We are the ONLY camp in Washington State that is a certified partner with NASA’s GLOBE Goes to Camp pilot program. GLOBE: Global Learning and Observations to Benefit the Environment provides exciting learning opportunities through hands-on experiences.\n\nStation Master Training\n\nDesigned for campers 15 year and up – including adults – this training program offers a unique opportunity to learn and lead. Campers learn the basics of the GLOBE program while becoming a “master” at leading activities in four core areas: Atmosphere; Biosphere; Hydrosphere and Pedosphere (Soil). This training is FREE and is offered through a virtual platform.\n\nLadybug Garden\n\nOur Ladybug Garden program offers a variety of connections to the garden. From gardening basics for elementary campers to upper grade level campers that utilize the garden in their GLOBE experiments.\n\nNature Days\n\nOne of our most popular programs, Nature Days is designed for our youngest campers to explore the living world around them. From leaf’s to bugs, from water to sky, campers have a great time playing games, running through the meadow to discover new and exciting elements of nature.\n\nVolunteer Opportunities – Camp Counselor\n\nIn addition to our Station Master program, we offer volunteer opportunities to youth (15+) and adults to assist with activities during each camp session. Camp Counselors lead activities, monitor play to ensure safety and guide campers from one activity to another.\n\nInternship Opportunities\n\nFor campers 15+ that want to spend more time at camp, we have a number of opportunities available to help explore career interests, expand skills, and develop work experiences. We work with each individual camper to design a program that meets their needs and career/work goals.\n\nMore Information\n\nMore program details, registration and date information can be found on our website at www.campwariki.com. You can also read our “Safety First” COVID-19 plan to keep everyone safe while at camp.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/02/Water-Bioshpere-Program2.jpg",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "Balance Soccer Summer Camps",
    "address": "18062 Keasey Road, Vernonia, OR, USA",
    "long": -123.20881016821164,
    "lat": 45.879931931621144,
    "link": "https://pdxparent.com/directory/balance-soccer-summer-camps/",
    "website": "http://www.balancesoccer.com/camps",
    "facebook": "https://www.facebook.com/balancesoccer",
    "instagram": "https://www.instagram.com/balancesoccer/",
    "description": "The most FUN, OVERNIGHT soccer camps ever!  Bunk with your friends and teammates after a long day of nonstop FUN!\n\nCamps are uniquely designed to develop soccer skills, encourage personal responsibility and improve self awareness. Balance Soccer Founder and Camp Director, Tyler Pagano will be there to guide parents and campers through it all.\n\nBoys Camp June 23-27 / Girls Camp July 13-17\n\nCamps are for all skill levels.  Ages 9-16.  Join us for our 5 year anniversary!\n\n300 foot Slip n Slide\nGrass Soccer Field\nHeated Outdoor Swimming Pool\nLazy River Float\nTons of Basketball Courts\nTHE MOST Creative Soccer Games and Competitions\nAdditional Training Options for Competitive Campers\nNCAA Soccer Playing Counselors",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/02/Balance-Soccer-Camps-2.375-%C3%97-1.25-in.jpg",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "French American International School",
    "address": "8500 NW Johnson Street",
    "long": -123.20881016821164,
    "lat": 45.879931931621144,
    "link": "https://pdxparent.com/directory/french-american-international-school-10/",
    "website": "http://www.faispdx.org",
    "facebook": "http://www.facebook.com/faispdx",
    "instagram": "http://www.instagram.com/faispdx",
    "description": "IMMERSION -- SO MUCH MORE THAN LEARNING ANOTHER LANGUAGE\n\nDo you want your child to develop a deeper understanding of other cultures, and empathy for different points of view?\n\nDiscover why immersion is so much more than learning another language... and how your child would flourish in the unique immersion and International Baccalaureate program at FAIS: Portland’s longest-established immersion school, and only IB school for preschool-8th grade.\n\n \n\n“I could not be more thrilled with the TPS program. There is clearly so much care, attention, and purpose... I love that they spend so much time outdoors, discovering and playing.”\n\n- TPS parent (early preschool for 2 1/2-year-olds)\n\nIN-PERSON CAMPUS VISITS ARE BACK!\n\nExperience our forest, outdoor play and learning spaces, and the rest of our 15-acre campus!\n\nRegister for a small group visit\nSet up an individual tour\nVirtual options also available",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/06/PDX-Parent-Featured-Online-Listing-All-Year-July-2022_600x300.jpg"
    ]
  },
  {
    "title": "School of Send, Mountain Bike Camps",
    "address": "Post Canyon Drive, Hood River, OR, USA",
    "long": -123.20881016821164,
    "lat": 45.879931931621144,
    "link": "https://pdxparent.com/directory/school-of-send-mountain-bike-camps/",
    "website": "https://www.schoolofsend.com/",
    "facebook": "https://www.facebook.com/schoolofsendmountainbiking/",
    "instagram": "https://www.instagram.com/schoolofsend/",
    "description": "School of Send offers kids mountain bike camps in Hood River, OR. We aim to create a community of like-minded riders that build mountain biking skills in a progressive, comfortable, and positive environment. All coaches are professionally certified through PMBIA and our 6:1 rider to coach ratio ensures that all riders progress safely. With after school, weekend, and summer options for kids ages 3+, we sure to have something for everyone.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/02/272430472_461579345548839_8216651580980334818_n-3-scaled.jpg",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "ONE RIVER SCHOOL OF ART + DESIGN",
    "address": "15010 SW Bangy Rd.",
    "long": -123.20881016821164,
    "lat": 45.879931931621144,
    "link": "https://pdxparent.com/directory/one-river-school-of-art-design-2/",
    "website": "https://lakeoswego.oneriverschool.com/",
    "facebook": "https://www.facebook.com/OneRiverSchoolLakeOswego/",
    "description": "Welcome to the One River School of Art + Design community! We offer fun Camps, in-studio and online classes, and birthday parties for grades K-12th and adults. We have a unique method for teaching art and design that allows students to have fun, build friendships, be creative, make inspiring artwork, and learn about contemporary art and artists while growing their skills and techniques.  We welcome all skill levels and provide both group and one-on-one support for each student.\n\nCLASSES: Our in-studio and online classes are ongoing and year-round which means you can jump in at any time. We offer focused classes such as Focus on Drawing and Animation as well as general classes like Art Shuffle that span a range of techniques and mediums.\n\nCAMPS: We offer Spring Break Camps, Summer Camps, and Winter Camps. Most of our camps are week-long with morning and afternoon options. Our camps range from Realistic Portrait Drawing and Street Art Painting to Digital Manga.\n\nCURRICULUM: Each lesson for camps and classes is based on contemporary artists and their practice. Students will learn techniques, skills, vocabulary, and knowledge related to and about each artist’s way of creating.\n\nTEACHERS: Teachers at One River School of Art + Design are carefully screened so that our students are provided with the right amount of technical support and individualized attention. Our research shows that when people are learning new creative concepts, it is important to have a teacher who instills trust and also has the skills to provide an inspiring lesson.\n\nMATERIALS: We supply each student with their own bin of materials.\n\nFACILITY: Our innovative facility is equipped with the latest technology which includes flat-screen TVs in each room, iPads for each teacher, and in the digital lab, touch-screen computers with stylist pens. We also have a gallery space to engage and inspire students. Here we exhibit both national and international professional artists as well as our own student-artists.\n\nHEALTH AND SAFETY: We take health and safety very seriously and follow CDC guidelines and other protocols to ensure the well-being of students and staff.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/01/KidsArtClasses-.jpg",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "Vibe of Portland",
    "address": "7414 Southeast 52nd Avenue, Portland, OR, USA",
    "long": -123.20881016821164,
    "lat": 45.879931931621144,
    "link": "https://pdxparent.com/directory/vibe-of-portland-2/",
    "website": "https://www.vibepdx.org",
    "facebook": "https://www.facebook.com/vibepdx",
    "instagram": "https://www.instagram.com/vibepdx/",
    "description": "Vibe of Portland offers classes and workshops in SE and NE Portland that nurture children to innovate, explore, and collaborate in the artmaking process. We offer classes in 2D and 3D Mixed Media, Illustration and Character Development, Print Making, Intro to Clay and Pottery, Mural Making, Sewing and more. Classes are after school, weekends, and no school days, with offerings for homeschool classes. Online classes include a Tuesday late evening Intro to Drawing.\n\nWe strive to create a safe environment for children to develop their creative side. Children who use their imagination the most will be able to come up with multiple solutions to problems, not just in art, but in any subject for any career they choose. By practicing a variety of techniques, they will develop not only their right brain, but also their hand-eye coordination and fine motor skills. In order for their projects to be vibrant and last over many years, we use artist-grade paints, brushes, glues, and other materials.\n\nVibe offers classes for youth grades 1-8, with online classes offered for high school through adult.\nConveniently located in several locations throughout SE and NE Portland.\nNo school workshops, winter and spring break camps.\nProjects where children work closely with teaching artists to create art for holiday events and community gatherings.\n\nVibe has implemented the following policies and rules to provide the best service and safety for all children, teachers and staff:\n\nClasses are limited to 10 children to allow for appropriate social distancing.\nOur staff will disinfect the studio multiple times per day.\nAll adults and children must wear a mask at all times and wash and/or sanitize hands upon entry and with reasonable frequency.\nWe are using a no-touch thermometer on all customers upon entrance. If we have any doubt over the health of any guest, admission will be denied and a refund will be applied.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2021/08/Vibe-w-kyra.jpeg",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "Little Kitchen Academy Bridgeport Village",
    "address": "7443 SW Bridgeport Road",
    "long":-123.20881016821164,
    "lat": 45.879931931621144,
    "link": "https://pdxparent.com/directory/little-kitchen-academy-bridgeport-village/",
    "website": "https://littlekitchenacademy.com/portland/",
    "facebook": "https://www.facebook.com/LKAPortlandBridgeportVillage/",
    "instagram": "https://www.instagram.com/lkaportlandbridgeportvillage/",
    "description": "Enjoy $50 toward a Fall Session!  Use code: HARVEST\n\nSeasonal sessions run year-round and are organized by age group (ages 3-5, 6-8, 9-12, and 13+ years old). Students experience a 3-hour class once a week during the school year or over five consecutive days during Summer, Winter, & Spring breaks. In each class, students learn how to make healthy, delicious and seasonal meals from scratch to consumption — all while experimenting with math and science concepts, working on their reading skills, and polishing up their table manners by sharing meals around the LKA community table (made with more than 33,000 recycled chopsticks).\n\nAs warm summer days give way to the crisp, fresh air of Fall and the leaves change from green to gold, we know that the harvest season has begun. In Fall, Mother Nature provides us with delicious fresh vegetables like squash, pumpkins, corn, and carrots. This bounty of fresh, colorful vegetables inspires our students to try new foods that they never knew they liked!\n\nOur Fall Season is a time of delight and exploration as our students try new recipes filled with fresh, local, seasonal vegetables. The weather may begin to get colder, but inside Little Kitchen Academy every day is full of warmth and joy as your child learns practical life skills that will last a lifetime.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/08/Fall.png",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "German International School",
    "address": "3900 SW Murray Blvd",
    "long": -123.20881016821164,
    "lat": 45.879931931621144,
    "link": "https://pdxparent.com/directory/german-international-school/",
    "website": "https://www.gspdx.org/",
    "facebook": "https://www.facebook.com/gspdx",
    "instagram": "https://www.instagram.com/gspdx/",
    "description": "As an International Baccalaureate (IB) World School the German International School (GIS) believe sin a whole-child approach to learning. Through the framework of the IB Primary Years Programme and language immersion in German or Chinese, students at GIS are globally-minded, adaptive, independent thinkers who grow to become lifelong learners.\n\nIn this immersion setting, Preschool students play, explore, and discover in a hands-on, inquiry-based environment. Kindergarteners build upon this experience with a continued emphasis on curiosity and play while learning to be more confident and independent learners.\n\nGIS's grade school students benefit from integrated learning opportunities across their subject areas. The language tracks are academically challenging, inquiry-based, hands-on programs that inspire and encourage curiosity, empathy, cooperation, and bilingualism. By the time your child graduates from GIS, they will be prepared for middle school and beyond with a solid foundation rooted in inquiry, respect for others and their environment, and proficiency in their chosen language.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2021/07/IMG_1226-scaled.jpg",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "Lovegood Performing Arts Company",
    "address": "10144 SW Park Way",
    "long": -123.20881016821164,
    "lat": 45.879931931621144,
    "link": "https://pdxparent.com/directory/lovegood-performing-arts-company/",
    "website": "https://www.lovegood.company",
    "facebook": "https://www.facebook.com/lovegood.company/",
    "instagram": "https://www.instagram.com/lovegood.company/",
    "description": "Lovegood Performing Arts Company opened its doors for in-person and virtual classes in February of 2021, serving students ages 8-22 with dance, voice, acting, and technical theater education and performance opportunities. \n\nFor students 10 to 22 years of age, Lovegood provides an opportunity to dive deep into four main focus areas: dance, voice, acting, and technical theater.  Many students take more than one focus area during a season, allowing them to engage in multiple areas of interest simultaneously.  The intention with classes based on focus areas is to allow for deep instruction and progression within the area or areas students want to explore most.\n\nFor 8 and 9 year old students Lovegood offers a weekly musical theater combination class that introduces their youngest students to dance, voice, and acting all in one class session.\n\nLovegood is unique in their approach to involving students in all aspects of the performing arts experience. In addition to on-stage performance opportunities youth participants in the technical theater program are working with adult instructors to learn the art of technical theater. They are working to build an all new black box studio, which is giving them hands-on experience with how a theater is put together. Lovegood is the only youth performing arts company in Beaverton with a professional black box studio venue as part of their educational space; which provides a unique opportunity for students to perform in the same place they attend classes and rehearse.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2021/03/LOVEGOOD_PRIMARY-1080.png"
    ]
  },
  {
    "title": "Oregon 4-H Summer Camps",
    "address": "5390 4 H Rd NW, Salem, OR, USA",
    "long": -123.20881016821164,
    "lat":45.879931931621144,
    "link": "https://pdxparent.com/directory/oregon-4-h-summer-camps/",
    "website": "https://extension.oregonstate.edu/4h/4-h-center-camps",
    "facebook": "https://www.facebook.com/Oregon4h/",
    "description": "Every kid deserves a classic 4-H summer camp experience.\n\nAt 4-H Summer Camp the days are filled with fun, new friends and laughter. The nights are filled with campfires, songs, stars and happy dreams.\n\nThe Oregon 4-H Center is offering a variety of sessions of overnight camp for children in grades 4-8.  Youth do not have to be in 4-H to enroll.  Registration is open to youth from any Oregon county.  All lodging, meals and recreation are included in this five-day, four-night experience.  Contact the Camp Registrar for campership funds information.  The Oregon 4-H Center is located in the forested Eola Hills west of Salem, Oregon.\n\nActivities include:\n\nArchery – at the newly remodeled archery range\nPool time – cool off and play with friends\nGiant Swings - a camper favorite\nArts & Crafts - for those creative kids\nCanoeing - on scenic Pagoda Pond\nOutdoor Science - for the explorer in all of us\nAnd, of course, songs around the camp fire!\n\nFor more than 100 years, Oregon State University Extension 4-H camping has been a proven and effective method of teaching youth life skills and providing a safe, engaging and FUN learning experience that provides lifelong friendships and memories for a lifetime. 4-H camping teaches youth to make their own decisions, solve problems, and manage their resources by providing hands-on experiential learning. Through involvement in the 4-H camping program, youth gain a better appreciation of living as a community by learning how to become more responsible and think critically. Designed for the next generation of leaders, explorers, designers and innovators our 4-H camp helps build skills for life.\n\nDates and Rates for 2022:\n\nFour Rivers 4-H Camp - June 28 – July 2, 2022 -$515\n\nWild West One 4-H Camp - July 12 -16, 2022 - $525\n\nWildlife Stewards 4-H Camp - July 26 – July 30, 2022 - $556\n\nWild West Two 4-H Camp - August 16 – August 20, 2022 - $525\n\nRegister now at   https://extension.oregonstate.edu/4h/4-h-center-camps",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/04/4-H-SUMMER-advertisement.png",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "OMSI Camps & Classes",
    "address": "1945 Southeast Water Avenue, Portland, OR, USA",
    "long": -123.20881016821164,
    "lat": 45.879931931621144,
    "link": "https://pdxparent.com/directory/omsi-camps-classes/",
    "website": "http://omsi.edu/summer",
    "facebook": "https://www.facebook.com/omsi.museum/",
    "instagram": "https://www.instagram.com/omsi",
    "description": "Celebrate summer, celebrate science!\n \nDrop your student off at our beautiful waterfront campus for a day camp or if you're looking for an overnight program, send them on the adventure of a lifetime! \n\nAt Camp Gray, youth can experience the tide pools and coastal landscape of Newport, while Hancock Field Station offers campers the opportunity to explore the wonders of Central Oregon’s high desert.\n\n \nSpaces are limited—go to omsi.edu/summer and get ready for a fun summer full of good vibes and big ideas!",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2021/02/CC21_SocialImages_1080x108031.jpg",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "North Clackamas Parks & Recreation Department",
    "address": "5440 Southeast Kellogg Creek Drive, Milwaukie, OR, USA",
    "long": -123.20881016821164,
    "lat": 45.879931931621144,
    "link": "https://pdxparent.com/directory/north-clackamas-parks-recreation-department/",
    "website": "http://ncprd.com/summer-camps",
    "facebook": "https://www.facebook.com/NCPRD/",
    "instagram": "https://www.instagram.com/ncprd/",
    "description": "NCPRD offers a wide variety of affordable day camps to keep kids of all ages active and having fun all summer long. Choose from science, nature, dance, horseback riding, theater, science, track and field, lacrosse, tennis, pull-the-flag football and more. Full day camps and disability-inclusive options are available. See the full schedule at ncprd.com/summer-camps. Registration opens April 12.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/03/DSCF9447_summer_sm.jpg",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "Pedalheads USA",
    "address": "4525 SE Stark St, Portland, OR 97215",
    "long": -123.20881016821164,
    "lat": 45.879931931621144,
    "link": "https://pdxparent.com/directory/pedalheads-usa/",
    "website": "https://www.pedalheads.com/",
    "facebook": "https://www.facebook.com/pedalheads/",
    "instagram": "https://www.instagram.com/pedalheads",
    "description": "Don't break your back – let the folks at Pedalheads help your kids learn to ride a bike! One of the more unique summer camps you will find, this week-long day camp specializes in helping kids as young as 3 get off training wheels and ride on their own – often within one week! Helping even the most tentative of kids, they focus on safety, fun, and skills. More than anything, they want to build confidence and a love of biking within their campers! For those with kids already riding on two wheels, Pedalheads also offers advanced levels that focus on road riding skills and safety.\n\nCamp options include half-day, all-day, and 1.5-hr tots level programs.\n\nIn the time of COVID-19, try a camp that is inherently safer and lower risk as they operate outdoors with lots of open space. They also have various protocols in place to ensure the health and safety of all camp participants. Let Pedalheads take out the yelling and frustration of teaching a kid to ride a bike and enjoy the benefits of enjoyable family rides afterwards. With over 25+ years' experience, put your trust in this popular, parent program staple. Sign up! ",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/02/180823_Rethink_Pedalheads-1742_EDIT-1.jpg",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "Vibe of Portland",
    "address": "7414 Southeast 52nd Avenue, Portland, OR, USA",
    "long": -123.20881016821164,
    "lat": 45.879931931621144,
    "link": "https://pdxparent.com/directory/vibe-of-portland-2/",
    "website": "https://www.vibepdx.org",
    "facebook": "https://www.facebook.com/vibepdx",
    "instagram": "https://www.instagram.com/vibepdx/",
    "description": "Vibe of Portland offers classes and workshops in SE and NE Portland that nurture children to innovate, explore, and collaborate in the artmaking process. We offer classes in 2D and 3D Mixed Media, Illustration and Character Development, Print Making, Intro to Clay and Pottery, Mural Making, Sewing and more. Classes are after school, weekends, and no school days, with offerings for homeschool classes. Online classes include a Tuesday late evening Intro to Drawing.\n\nWe strive to create a safe environment for children to develop their creative side. Children who use their imagination the most will be able to come up with multiple solutions to problems, not just in art, but in any subject for any career they choose. By practicing a variety of techniques, they will develop not only their right brain, but also their hand-eye coordination and fine motor skills. In order for their projects to be vibrant and last over many years, we use artist-grade paints, brushes, glues, and other materials.\n\nVibe offers classes for youth grades 1-8, with online classes offered for high school through adult.\nConveniently located in several locations throughout SE and NE Portland.\nNo school workshops, winter and spring break camps.\nProjects where children work closely with teaching artists to create art for holiday events and community gatherings.\n\nVibe has implemented the following policies and rules to provide the best service and safety for all children, teachers and staff:\n\nClasses are limited to 10 children to allow for appropriate social distancing.\nOur staff will disinfect the studio multiple times per day.\nAll adults and children must wear a mask at all times and wash and/or sanitize hands upon entry and with reasonable frequency.\nWe are using a no-touch thermometer on all customers upon entrance. If we have any doubt over the health of any guest, admission will be denied and a refund will be applied.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2021/08/Vibe-w-kyra.jpeg",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "Topaz Farm on Sauvie Island",
    "address": "17100 NW Sauvie Island Rd",
    "long": -123.20881016821164,
    "lat": 45.879931931621144,
    "link": "https://pdxparent.com/directory/topaz-farm-on-sauvie-island/",
    "website": "http://topazfarm.com",
    "facebook": "https://www.facebook.com/TopazFarmPDX",
    "instagram": "https://www.instagram.com/topazfarm/",
    "description": "Topaz Farm is a family farm for all families! We're first-generation farmers, but our three-generation family operates the 130 acre, no-spray and regenerative farm with lots of activities for kids and families including:\n\nDozens of animals including mini-donkeys, mini-goats, pigs, runner ducks and more.\nU-pick berries and u-cut flowers\nThe island's first and only sunflower festival and maze\nFarm to Plate picnics\nHarvest festivals featuring live music\nThe island's largest farm stand, featuring house-made kid (and adult!) food, drinks and snacks\nAn outdoor bar and grill\nFall harvest activities including a huge corn maze, hay rides and pumpkin patches\n\nWith our on-site parter, the non-profit Sauvie Island Center, we're able to host summer and school break camps, workshops and volunteer days for kids and adults throughout the year.\n\nMany of our special events are by pre-order or reservation-only, so be sure to sign up for our email newsletter on our website or follow us on social media for all the latest announcements.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/04/logotrapezoid_blk_small.png",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "Cognizart by MetroArts Inc. 360 Arts Camp",
    "address": "4033 Southwest Canyon Road, Portland, OR, USA",
    "long": -123.20881016821164,
    "lat": 45.879931931621144,
    "link": "https://pdxparent.com/directory/cognizart-by-metroarts-inc-360-arts-camp/",
    "website": "http://metroartsinc.org/kids-camp",
    "facebook": "https://www.facebook.com/cognizartbymetroartsinc",
    "instagram": "https://www.instagram.com/cognizartbymetroartsinc/",
    "description": "Three weeks only!\nWeek 1, July 11-15, 2022\nWeek 2, July 18-22, 2022\nWeek 3, July 25-29, 2022\n\nIgniting Creativity, Fun & Friendship\nNewmark Theatre, 1111 SW Broadway\nWorld Forestry Center, 4033 SW Canyon\n9 a.m. to 4 p.m.\n​\nAbout 360 Arts Camp\n​Since 1993, Cognizart by MetroArts Inc. Kids camp has given kids ages 6 1/2-12 a chance to be immersed in visual arts, music, theater, and dance Monday through Friday. This is 360 Arts Education!\n\nAll campers must follow instructions, participate, collaborate with others, read and write, and be respectful self-managers. The overall lesson plans and daily goals for creation for both age groups are similar, with age-appropriate challenge-level to keep the artistic spark alive.\n\nCampers ages 6 1/2 to 9\nLesson plans for younger campers focus on encouraging natural creativity, fearlessness, and gifts. Younger campers are often paired with Intern helpers who can help to ignite confidence and assist with reading or writing. However, our ability to provide \"hands-on\" assistance is limited.\n\nCampers ages 10 to 12\nLesson plans for older campers allow for the opportunity to explore and collaborate with peers. Older campers create more complex artistic projects, try new things, and showcase their unique talents and gifts.\n\n​Friday Artists\nOn Friday of each camp, we work with artists from diverse cultural and ethnic backgrounds to perform and workshop with our campers.\nPrevious Friday Artists include Journey Brazil, En Taiko, Natya Leela Academy, Inka Jam, and Grupo Condor.\nThe incredible 2022 Friday Artists Are\nLatin Groove PDX Productions\nMic Crenshaw Performs Social Justice Hip Hop​\n\nThe Venues\nWeek 1 - Newmark Theatre, 1111 SW Broadway\nWe're returning to our home for the first week of 360 Arts Camp in 2022. We will be utilizing the Winningstad & Brunish Theatres. as well as lobby space. It's a very cool location.\n\nWeeks 2 & 3 - World Forestry Center Central Plaza & Cheatham Hall\n4033 SW Canyon Road, Portland, OR 97221. It's an immersive and vibrant distinctly Oregon location nestled in the trees.\nWe selected the World Forestry Center because of its convenient location off Highway 26, across the zoo's parking lot, and a few steps from the Max station. We strongly encourage taking public transportation.\n\n360 Arts Camp will be located at the tented outdoor Central Plaza to the left of the Discovery Center and in Cheatham Hall, which offers ample space for socially distancing and creation. Campers will be indoors and outdoors throughout the day and provided with outdoor mask breaks. Campers will be in age-based pods. We may also take field trips to explore the Japanese Garden, Children's Museum, zoo, and surrounding trails.\n\nAccess to the Arts - Scholarships Available!\nWe believe in the vital importance of arts education in self-confidence, wellbeing, and social inclusion. Therefore, we offer scholarships for children to attend 360 Arts Camp. Scholarships, generally 20-90%, are needs-based and awarded on camper loads and will be reviewed and awarded monthly until we reach capacity.\n\n​What happens at 360 Arts Camp?\nCampers arrive between 8:50 a.m. and 9 a.m., participate in fun warm-up exercises, and receive the schedule for the day. Monday through Thursday, campers create art in two disciplines (visual arts and music, for instance) in the morning and two in the afternoon (theater and dance, for example). The order of the disciplines alternates each day.\nOn Fridays, campers utilize the skills and creations throughout the week to create a group performance, incorporating lessons learned from our multicultural guest artists. Therefore, attendance each day is important.\nCamp ends at 3:58 p.m. with a prompt pickup at 4 p.m.\n\n​The Faculty\nEach of our faculty members is a trained artist and educator in their respective visual arts, music, theater, and dance disciplines. Many will be returning to our camp, having been a part of it for years.\n\n​The Counselors (formerly known as Interns!) - Kids Ages 13-18\nWe have opportunities for older kids who would like to participate and earn valuable volunteer experience. These incredible teenagers, who proudly wear green t-shirts, are usually former campers. They have the opportunity to supervise, create art, and work directly to inspire younger kids.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/05/Oversized-Vistaprint-Postcard-Front-copy.jpg"
    ]
  },
  {
    "title": "Adventure Camp",
    "address": "14605 SW Weir Road",
    "long": -122.82844750704774,
    "lat": 45.44882331267618,
    "link": "https://pdxparent.com/directory/adventure-camp-2/",
    "website": "http://adventurecampkids.org",
    "facebook": "https://www.facebook.com/adventurecampkids",
    "instagram": "https://www.instagram.com/adventurecampkids/",
    "description": "Adventure Camp is an all-day summer camp for kids in Kindergarten - 5th Grade. Each of our 9 themed weeks include field trips to top Portland locations, art & cooking projects, water slides, outdoor games on our 26 acre campus, and much more! Register now to save a spot for the adventures ahead - sibling discounts are available!\n\nLunches, before care, and after care are also available. Adventure Camp is a program by Southwest Bible Church.\n\nClick the links below for more information:\n\nRegister Here\n\nSchedule & Pricing\n\nOur Mission\n\nFAQ’s\n\nPhoto Highlights\n\nContact Us",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/03/HL-3-1-scaled.jpg",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "French American International School",
    "address": "8500 NW Johnson Street",
    "long": -122.82844750704774,
    "lat":45.44882331267618,
    "link": "https://pdxparent.com/directory/french-american-international-school-10/",
    "website": "http://www.faispdx.org",
    "facebook": "http://www.facebook.com/faispdx",
    "instagram": "http://www.instagram.com/faispdx",
    "description": "IMMERSION -- SO MUCH MORE THAN LEARNING ANOTHER LANGUAGE\n\nDo you want your child to develop a deeper understanding of other cultures, and empathy for different points of view?\n\nDiscover why immersion is so much more than learning another language... and how your child would flourish in the unique immersion and International Baccalaureate program at FAIS: Portland’s longest-established immersion school, and only IB school for preschool-8th grade.\n\n \n\n“I could not be more thrilled with the TPS program. There is clearly so much care, attention, and purpose... I love that they spend so much time outdoors, discovering and playing.”\n\n- TPS parent (early preschool for 2 1/2-year-olds)\n\nIN-PERSON CAMPUS VISITS ARE BACK!\n\nExperience our forest, outdoor play and learning spaces, and the rest of our 15-acre campus!\n\nRegister for a small group visit\nSet up an individual tour\nVirtual options also available",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/06/PDX-Parent-Featured-Online-Listing-All-Year-July-2022_600x300.jpg"
    ]
  },
  {
    "title": "Lovegood Performing Arts Company",
    "address": "10144 SW Park Way",
    "long": -122.82844750704774,
    "lat": 45.44882331267618,
    "link": "https://pdxparent.com/directory/lovegood-performing-arts-company/",
    "website": "https://www.lovegood.company",
    "facebook": "https://www.facebook.com/lovegood.company/",
    "instagram": "https://www.instagram.com/lovegood.company/",
    "description": "Lovegood Performing Arts Company opened its doors for in-person and virtual classes in February of 2021, serving students ages 8-22 with dance, voice, acting, and technical theater education and performance opportunities. \n\nFor students 10 to 22 years of age, Lovegood provides an opportunity to dive deep into four main focus areas: dance, voice, acting, and technical theater.  Many students take more than one focus area during a season, allowing them to engage in multiple areas of interest simultaneously.  The intention with classes based on focus areas is to allow for deep instruction and progression within the area or areas students want to explore most.\n\nFor 8 and 9 year old students Lovegood offers a weekly musical theater combination class that introduces their youngest students to dance, voice, and acting all in one class session.\n\nLovegood is unique in their approach to involving students in all aspects of the performing arts experience. In addition to on-stage performance opportunities youth participants in the technical theater program are working with adult instructors to learn the art of technical theater. They are working to build an all new black box studio, which is giving them hands-on experience with how a theater is put together. Lovegood is the only youth performing arts company in Beaverton with a professional black box studio venue as part of their educational space; which provides a unique opportunity for students to perform in the same place they attend classes and rehearse.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2021/03/LOVEGOOD_PRIMARY-1080.png"
    ]
  },
  {
    "title": "Trackers Earth",
    "address": "4617 Southeast Milwaukie Avenue, Portland, OR , USA",
    "long": -122.82844750704774,
    "lat": 45.44882331267618,
    "link": "https://pdxparent.com/directory/trackers-earth/",
    "website": "https://www.trackerspdx.com/",
    "facebook": "https://www.facebook.com/trackersearth",
    "instagram": "https://www.instagram.com/trackersearth/",
    "description": "Trackers Earth award-winning camps are action-packed, immersive guided quests for youth of all ages. Timeless skills, friends, and outdoor connection with over 20 themes like Archery, Fishing, Wilderness Survival, & Outdoor Sport. Creating one-of-a-kind youth adventures for over 15 years.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2021/04/kayak-camp-2019_2-scaled.jpg",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "PAM CUT, Center for an Untold Tomorrow",
    "address": "934 SW Salmon St.",
    "long": -122.82844750704774,
    "lat": 45.44882331267618,
    "link": "https://pdxparent.com/directory/pam-cut-center-for-an-untold-tomorrow/",
    "website": "https://pamcut.org/",
    "instagram": "https://www.instagram.com/pam_cut/",
    "description": "PAM CUT, Center for an Untold Tomorrow is a Portland-based year-round organization and space where artists and audiences explore our region and the world through cinema and cinematic storytelling in all its forms!\n\nSummer Camps: The Center for an Untold Tomorrow is the place to be for what’s new, now, next in multimedia storytelling. Kids and teens ages 8 – 14 can learn from working artists and immerse themselves in media arts, animation, gaming, podcasts, and technology this summer!",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/04/youth-classes-cropped.jpg"
    ]
  },
  {
    "title": "Oregon Gymnastics Academy",
    "address": "16305 NW Bethany Ct, Suite 109",
    "link": "https://pdxparent.com/directory/oregon-gymnastics-academy-2/",
    "website": "http://www.ogagym.org",
    "instagram": "https://www.instagram.com/oregongymnasticsacademy/",
    "description": "OGA provides a top quality gymnastics education to children of all ages and abilities. We strive to develop high caliber athletes with strong character who are able to be successful and progress in the sport to the highest level they desire. Through the sport of gymnastics, OGA teaches life lessons and skills our athletes will take with them and utilize to have a positive impact on the world.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/02/OGA-LOGO-Full-Color-With-Name.png",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "Vibe of Portland",
    "address": "7414 Southeast 52nd Avenue, Portland, OR, USA",
    "link": "https://pdxparent.com/directory/vibe-of-portland-2/",
    "website": "https://www.vibepdx.org",
    "facebook": "https://www.facebook.com/vibepdx",
    "instagram": "https://www.instagram.com/vibepdx/",
    "description": "Vibe of Portland offers classes and workshops in SE and NE Portland that nurture children to innovate, explore, and collaborate in the artmaking process. We offer classes in 2D and 3D Mixed Media, Illustration and Character Development, Print Making, Intro to Clay and Pottery, Mural Making, Sewing and more. Classes are after school, weekends, and no school days, with offerings for homeschool classes. Online classes include a Tuesday late evening Intro to Drawing.\n\nWe strive to create a safe environment for children to develop their creative side. Children who use their imagination the most will be able to come up with multiple solutions to problems, not just in art, but in any subject for any career they choose. By practicing a variety of techniques, they will develop not only their right brain, but also their hand-eye coordination and fine motor skills. In order for their projects to be vibrant and last over many years, we use artist-grade paints, brushes, glues, and other materials.\n\nVibe offers classes for youth grades 1-8, with online classes offered for high school through adult.\nConveniently located in several locations throughout SE and NE Portland.\nNo school workshops, winter and spring break camps.\nProjects where children work closely with teaching artists to create art for holiday events and community gatherings.\n\nVibe has implemented the following policies and rules to provide the best service and safety for all children, teachers and staff:\n\nClasses are limited to 10 children to allow for appropriate social distancing.\nOur staff will disinfect the studio multiple times per day.\nAll adults and children must wear a mask at all times and wash and/or sanitize hands upon entry and with reasonable frequency.\nWe are using a no-touch thermometer on all customers upon entrance. If we have any doubt over the health of any guest, admission will be denied and a refund will be applied.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2021/08/Vibe-w-kyra.jpeg",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "Camp Wa-Ri-Ki",
    "address": "17051 Washougal River Road, Washougal, WA, USA",
    "link": "https://pdxparent.com/directory/camp-wa-ri-ki/",
    "website": "http://www.campwariki.com",
    "facebook": "https://www.facebook.com/campwarikifun/",
    "instagram": "https://www.instagram.com/kiwaniswariki/",
    "description": "Fun! That’s what is waiting for campers of all ages this year at Camp Wa-Ri-Ki!\n\nKiwanis Camp Wa-Ri-Ki, located in Washougal, Skamania County, Washington is 18+ acres of beautiful land in the heart of the Gifford Pinchot National Forest. It is our mission to provide an outdoor experience that offers optimal development of at-risk youth and our communities through recreational, educational and leadership opportunities. We offer programs in four categories: Nature-based Learning; Leadership and Personal Development; Fun, Exploration and Adventure and Outdoor Skills. Many camp activities integrate with local school’s STEM and STEAM curriculum.\n\nNASA’s GLOBE Goes to Camp\n\nOur programs are available by age group to allow peer-learning, appropriate outcome measures and to ensure safety of participants. We are the ONLY camp in Washington State that is a certified partner with NASA’s GLOBE Goes to Camp pilot program. GLOBE: Global Learning and Observations to Benefit the Environment provides exciting learning opportunities through hands-on experiences.\n\nStation Master Training\n\nDesigned for campers 15 year and up – including adults – this training program offers a unique opportunity to learn and lead. Campers learn the basics of the GLOBE program while becoming a “master” at leading activities in four core areas: Atmosphere; Biosphere; Hydrosphere and Pedosphere (Soil). This training is FREE and is offered through a virtual platform.\n\nLadybug Garden\n\nOur Ladybug Garden program offers a variety of connections to the garden. From gardening basics for elementary campers to upper grade level campers that utilize the garden in their GLOBE experiments.\n\nNature Days\n\nOne of our most popular programs, Nature Days is designed for our youngest campers to explore the living world around them. From leaf’s to bugs, from water to sky, campers have a great time playing games, running through the meadow to discover new and exciting elements of nature.\n\nVolunteer Opportunities – Camp Counselor\n\nIn addition to our Station Master program, we offer volunteer opportunities to youth (15+) and adults to assist with activities during each camp session. Camp Counselors lead activities, monitor play to ensure safety and guide campers from one activity to another.\n\nInternship Opportunities\n\nFor campers 15+ that want to spend more time at camp, we have a number of opportunities available to help explore career interests, expand skills, and develop work experiences. We work with each individual camper to design a program that meets their needs and career/work goals.\n\nMore Information\n\nMore program details, registration and date information can be found on our website at www.campwariki.com. You can also read our “Safety First” COVID-19 plan to keep everyone safe while at camp.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/02/Water-Bioshpere-Program2.jpg",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "North Clackamas Parks & Recreation Department",
    "address": "5440 Southeast Kellogg Creek Drive, Milwaukie, OR, USA",
    "link": "https://pdxparent.com/directory/north-clackamas-parks-recreation-department/",
    "website": "http://ncprd.com/summer-camps",
    "facebook": "https://www.facebook.com/NCPRD/",
    "instagram": "https://www.instagram.com/ncprd/",
    "description": "NCPRD offers a wide variety of affordable day camps to keep kids of all ages active and having fun all summer long. Choose from science, nature, dance, horseback riding, theater, science, track and field, lacrosse, tennis, pull-the-flag football and more. Full day camps and disability-inclusive options are available. See the full schedule at ncprd.com/summer-camps. Registration opens April 12.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/03/DSCF9447_summer_sm.jpg",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E",
      "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"
    ]
  },
  {
    "title": "Steve & Kate’s Camp",
    "address": "601 Northeast Cesar E Chavez Boulevard, Portland, OR, USA",
    "link": "https://pdxparent.com/directory/steve-kates-camp/",
    "website": "https://steveandkatescamp.com/portland/",
    "description": "When you trust kids, they trust themselves. \n\nSince 1980, Steve & Kate’s has put kids in charge of their own learning experience. They try, fail, and learn on their own. They learn to trust their own judgment and tackle the challenges of an ever-changing world with creativity and confidence.\n\nCampers choose minute to minute from a variety of activities including, sewing, stop-motion animation, music, sports & recreation, makers crafts, baking, and more. They'll decide what they want to do, and for how long. \n\nThis summer families can buy as many days as they’d like, and use them at any time. No weekly reservations required–just show up! \n\nLunch and snacks are included daily. Just like everything else here, kids will get to choose their entree from a variety of local vendors. We throw in healthy snacks and the occasional frozen treat to boot. \n\nAges 4-12\n\nAll Saints School, Portland\n\nportland@steveandkate.com\n\nLearn more at https://steveandkatescamp.com/portland/",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/02/Screen-Shot-2022-02-09-at-3.25.31-PM.png"
    ]
  },
  {
    "title": "Classical Ballet Academy",
    "address": "7970 SE Milwaukie Avenue",
    "link": "https://pdxparent.com/directory/classical-ballet-academy/",
    "website": "http://www.classicalballet.net",
    "facebook": "https://www.facebook.com/classicalballetacademypdx",
    "instagram": "https://www.instagram.com/classicalballetacademypdx/",
    "description": "Classical Ballet Academy is a premier dance studio in Portland, Oregon founded in 2004. Our mission is to educate, inspire and transform dancers of all ages through the study of classical ballet and complementary dance forms. Reshaping the mind and body takes discipline and strength. CBA is dedicated to helping each individual achieve this goal.",
    "images": ["https://pdxparent.com/wp-content/uploads/2022/08/CIBA-188.jpg"]
  },
  {
    "title": "My Gym Children’s Fitness Center – Happy Valley",
    "link": "https://pdxparent.com/directory/my-gym-childrens-fitness-center-happy-valley/",
    "description": "My Gym offers super fun classes, camps, Parents' Night Outs, private birthday parties and more for ages 4 months to 10 years old.",
    "images": []
  },
  {
    "title": "Camp Two Roads",
    "link": "https://pdxparent.com/directory/camp-two-roads/",
    "description": "Camp Two Roads programming is designed to support women's empowerment and has been voted a Top 5 Overnight Camp by PDX Parent Readers 2 years in a row. Every girl leaves at the end of the week knowing someone believes in them!\n\nCamp Two Roads believes that outdoor happiness deepens awareness, kinship, and adventure.\n\nWe strive to provide the tools necessary to empower young women to be confident leaders both in the outdoors and within their communities. We work to broaden their horizon of possibilities so that they have the courage and ability to blaze their own roads in life.\n\nAn All Girls Camp\n\nGirls are more self-confident, open to new experiences and capable of forging deep lasting friendships in the comfort of an all-girls environment, free from the distractions of the opposite gender.\nGirls are encouraged to make decisions for themselves, to try new things, and to develop new passions.\n\nLiving Close to Nature\n\nCamp is a place for girls to disconnect from modern technology and immerse themselves in nature.\nGirls thrive when encouraged to make real connections with their peers.\n\nAvenues of Adventure\n\nOut of the ordinary experiences allow girls to explore new talents and develop a more confident sense of self.  \nEach girl is encouraged to boldly embrace challenges and to simply shine at being herself.\n\nWhere Every Girl Belongs\n\nWe value healthy competition, enthusiastic cooperation, kind communication and playful participation. \nCamp is a positive community where girls feel safe, supported, and valued.\n\nEvery girl leaves at the end of the week knowing someone believes in them!\n\nCampers develop confidence with outdoor skills such as knots/lashing, compasses and fire building. Also, they learn how to cook in the outdoors, study nature and build positive communication skills through teamwork challenges. We turn off the technology for a full week and exercise interpersonal skills.  Camp Two Roads is fun, safe and an important opportunity for young women to get to know themselves and the world around them.\n\nRecreation activities include, swimming and water sport, archery, arts and crafts, hiking and more. Each evening brings a full campfire program and optional late-night activities including a night hike, and an outdoor movie under the stars with popcorn or an all-camp dance.\n\nGive your girl the opportunity to have a week full of fun friendships and a lifetime of memories. ",
    "images": []
  },
  {
    "title": "Children’s Healing Art Project",
    "link": "https://pdxparent.com/directory/childrens-healing-art-project/",
    "description": "Join the fun at Children's Healing Art Project (CHAP) Inclusive Summer Art Workshops - named Best Arts & Crafts Camps/Classes by PDX Parent readers 2 years in a row! Choose between in-person and virtual events, as well as 4-day Workshops and 1-day Dailies. Open to all children! Register now for Fuzzy Wuzzy Week, Art In Motion, Up-Cycling, Geometric Vibes, and more! At CHAP, kids will stretch their imaginations, explore new art techniques, try things they've never tried before, and discover how innately creative they really are. There's something for everyone in our Workshops and Dailies:\n\n4-Day Workshops:\nFuzzy Wuzzy Week\n\nIn-Person Workshop 7/19/22 through 7/22/22 from 10:00am to 1:00pm. Explore the tactile world filled with various textures, yarns, cloth, felt, and more.\n\nGet Creative!\n\nVirtual Workshop 7/26/22 through 7/29/22 from 10:00am to noon. Variety is the spice of life! Your child will get to try out a series of new art projects. All supplies are pre-delivered to your home so participants must live in the Portland-metro area.\n\nArt in Motion\n\nIn-Person Workshop 8/2/22 through 8/5/22 from 10:00am to 1:00pm. Together, we’ll use movement to create art. Projects may include things like kinetic sculptures, hanging mobiles, using your feet/body to make art, kite-making, and more.\n\nDailies! 1-day Workshops:\nAnimal Art\n\nVirtual Daily 8/9/22 from 10:00am to noon. Lions and tigers and bears — let’s have fun with it! Projects are all animal-themed.\n\nUp-Cycling\n\nIn-Person Daily 8/10/22 from 10:00am to 1:00pm. We’ll get eco-friendly by using items that already exist and repurposing them in to art. Projects may include mosaics, collages, mixed-media art, and more.\n\nGeometric Vibes\n\nIn-Person Daily 8/11/22 from 10:00am to 1:00pm. Come paint with masking tape reveal, landscape with geometric lines, create 2-D design projects, etc.\n\nFunds raised through our Inclusive Art Workshops benefit CHAP's mission of bringing the healing power of art to children and families facing medical challenges. In-person Workshops and Dailies are at the CHAP studio in the Sellwood neighborhood of Portland (walking distance to Oaks Park). Virtual events take place via Zoom.\n\nClick here for more info and to register you child(ren) and/or pre-teen(s). Questions? Email info@chappdx.org or call 503-243-5294. Please join us!",
    "images": []
  },
  {
    "title": "Camp Shazaam PDX",
    "link": "https://pdxparent.com/directory/camp-shazaam-pdx/",
    "description": "Camp Shazaam is offering four special sessions including a middle school Pride camp! We do arts and crafts, get outside, and explore the performing arts.",
    "images": []
  },
  {
    "title": "Skate Like a Girl Summer Camp",
    "link": "https://pdxparent.com/directory/skate-like-a-girl-summer-camp/",
    "description": "Skate Like a Girl\n\nAll-gender and girls weeks\n\nMonday - Friday\n\nAll skill levels welcome, ages 6+\n\n7 different locations!\n\nMore information at www.skatelikeagirl.com",
    "images": []
  },
  {
    "title": "The Independent Dance Project",
    "address": "5514 SE Foster Rd",
    "link": "https://pdxparent.com/directory/the-independent-dance-project/",
    "website": "http://www.idppdx.com",
    "description": "IDP is not just a dance studio but a community. Whether your dancer is just starting their dance journey or is a seasoned dancer looking to push their technique to the next level, we have classes for them.\n\nThe Independent Dance Project focuses on the whole dancer, educating them not just in the technique of a given genre, but in the etiquette and discipline of dance education.\n\nOur faculty provides quality dance instruction with the goal of instilling confidence and strength in each student. We have classes for ages 3-18.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/02/IDP-Est2011-02-scaled.jpg"
    ]
  },
  {
    "title": "Code Galaxy Summer Camp",
    "link": "https://pdxparent.com/directory/code-galaxy-summer-camp/",
    "description": "Code Galaxy Summer Camps are designed for kids to develop programming skills. From Scratch + Minecraft to Python Programming and Web Development, our coding camps for kids are the perfect way to spend time off school. All our summer camps are 100% virtual with flexible times for both parents and students. Enroll today!\n",
    "images": []
  },
  {
    "title": "Chapel Theatre Theatre Camps",
    "address": "4107 Southeast Harrison Street, Milwaukie, OR, USA",
    "link": "https://pdxparent.com/directory/chapel-theatre-theatre-camps/",
    "website": "https://chapeltheatremilwaukie.com/2022/01/10/2022-summer-camps/",
    "facebook": "https://www.facebook.com/chapeltheatremilwaukie",
    "instagram": "http://instagram.com/chapeltheatre",
    "description": "Chapel Theatre is a performing arts venue in Milwaukie, just a few minutes from Sellwood and Woodstock. We produce theatrical performances and offer space for others to do the same. This summer, we will offer a week long camp for youth ages 5-10 and teens age 11-17. Teens have the option to sign up for a 2-week camp, as well. Students will have an opportunity to learn from Chapel Theatre professionals in the areas of acting, movement theatre, dance, improv, and will end the week with a showcase of what they learned. Parents are invited to come and see their student perform on Friday of camp week.\n\nCamps are half-day, grouped with students of a similar age. July 11-15 is for youth aged 5-10. August 1-5 and 8-12 are camps f0r teens aged 11-17. Camps are $180 for a week or $320 for 2 weeks. For more information on registration, visit our website here: https://chapeltheatremilwaukie.com/2022/01/10/2022-summer-camps/",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/01/new-paint-scaled.jpeg"
    ]
  },
  {
    "title": "Cathedral Park Performing Arts Collective",
    "link": "https://pdxparent.com/directory/cathedral-park-performing-arts-collective/",
    "description": "Cathedral Park Performing Arts Collective is a nonprofit arts organization offering music and theatre classes, camps, and workshops for ages 7-17 in St. Johns! cathedralparkarts.org",
    "images": []
  },
  {
    "title": "BB Camp",
    "link": "https://pdxparent.com/directory/bb-camp/",
    "description": "For over 100 summers, BB Camp has been a vibrant & inclusive Jewish community, creating immersive experiences for children of all ages and backgrounds. Our Overnight and Day Camps provide each camper with formative experiences to build on as they develop their own personal Jewish identity. We celebrate our diverse community and work tirelessly to create a balanced schedule of group activities, daily elective offerings, trips, alternative Shabbat programs, and more, to ensure that every child makes the most of their Camp experience.",
    "images": []
  },
  {
    "title": "Breakthrough Basketball Camps",
    "link": "https://pdxparent.com/directory/breakthrough-basketball-camps/",
    "website": "https://www.breakthroughbasketball.com/camps/oregon.html",
    "description": "Breakthrough Basketball provides skill development camps for boys & girls 3rd - 12th grades.\n\nWe also preach character development with life lesson speeches, pre and post camp.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2021/04/BBlogo-Oval-2a-4C-small.jpg"
    ]
  },
  {
    "title": "Circus Cascadia Summer Camp",
    "link": "https://pdxparent.com/directory/circus-cascadia-summer-camp/",
    "description": "Our camp allows children to get creative, move their bodies and have fun outdoors.  Many circus skills will be introduced in our beautiful Big Top.",
    "images": []
  },
  {
    "title": "Friendly House Winter Camps",
    "address": "1737 Northwest 26th Avenue, Portland, OR, USA",
    "link": "https://pdxparent.com/directory/friendly-house-winter-camps/",
    "website": "http://www.fhpdx.org/winter-camp",
    "facebook": "http://facebook.com/friendlyhouseinc",
    "instagram": "http://instagram.com/friendlyhousepdx",
    "description": "2022 Winter Camp Enrolling Now!\n\nCome for one day or for the entire break! Each day includes programming for grades K–5 from 7:30am to 6pm with engaging activities, creative play, and snacks. Pricing is by day, with a sliding scale to fit your family’s budget.\n\nVisit our website to learn more. See below for a quick summary of our upcoming camps.\n\nWeek 1\nMonday, December 19th—Arctic Expedition: Gym games and arctic animal crafts\nTuesday, December 20th—Winter Woodland: A nature scavenger walk and creative crafting\nWednesday, December 21st—Mythical Magic: Treasure hunt, crafts, and gym games\nThursday, December 22nd—A Fine Day for the Fine Arts: A trip to the Portland Art Museum\nFriday, December 23rd—Swim Day: A trip to Mount Scott Community Pool\n \n \nWeek 2\nTuesday, December 27th—Whatcha Got Cookin’?: Cooking and baking\nWednesday, December 28th—Puppetry Day: Watch and create a puppet show\nThursday, December 29th—New Year’s Bash: Crafts, gym games, and a dance party\nFriday, December 30th—Our Forest Home: A trip to the World Forestry Museum\n \n \n \n \n \n\n ",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/11/11.-Examiner-2of2-WinterBreak.png"
    ]
  },
  {
    "title": "Ekone Summer Camps",
    "address": "401 Ekone Road, Goldendale, WA, USA",
    "link": "https://pdxparent.com/directory/ekone-summer-camps/",
    "website": "http://www.ekone.org",
    "facebook": "https://www.facebook.com/ekoneranch",
    "description": "Since 1986, Ekone has been a home to children in the summertime.  At Ekone, campers experience being an important member of an inclusive community, in relationship and service to a place.  We believe that this experience is fundamental to our human nature, transformative for those who experience it, and essential to creating a viable, vibrant future on Earth. \n\nAnd fun!  If there's anything Ekone is known for, it's finding the fun in everything. \n\nDays at camp are spent almost entirely outside, with a community of 25-30 children aged 8-18, and a crew of 10-15 staff and mentors aged 16-80.  Together, we engage in play, work, skill-building, and activities designed to connect us to nature, each other, and ourselves.  We learn to listen closely to the birds.  We stalk the deer at the pond.  We create art from found objects.  We run wild through the woods.  We shed some of the busy-ness of modern life and remember how to make our own fun.\n\nWe also care for the needs of our place and community, taking responsibility for ourselves and our shared experience.  We cook meals, clean up after them, tend the garden, feed the animals, buck hay, haul firewood, and engage in conservation projects on the land.  We learn to listen to each other, speak our truth with kindness, and create the kind of community we want to live in.\n\nAnd we simply enjoy life on the ranch.  Campers sleep in the rustic A-frame bunkhouse or under the stars.  Our wholesome, delicious meals are cooked from scratch, and most of our produce is from Ekone's own garden.  We take a break from screens, mirrors, makeup, competition, and drama.  We swim in the pond, swing on the rope swings, catch frogs, and build forts. \n\n​This year we will be providing both Family Camps and some overnight camps for teens. Family Camps will provide day-camp style activities during the day for kids, with shared family meals and plenty of time together as well. ",
    "images": []
  },
  {
    "title": "Acrylic Painting Camp for Kids!",
    "link": "https://pdxparent.com/directory/acrylic-painting-camp-for-kids/",
    "description": "Greetings! Let’s learn all about acrylic painting in this five-day camp for kids! Cost: $100\nDate: August 22nd – 26th\n\nhttps://fb.me/e/1Za3SqEBV",
    "images": []
  },
  {
    "title": "Camp Shazaam PDX",
    "link": "https://pdxparent.com/directory/camp-shazaam-pdx/",
    "description": "Camp Shazaam is offering four special sessions including a middle school Pride camp! We do arts and crafts, get outside, and explore the performing arts.",
    "images": []
  },
  {
    "title": "Portland Education Collab",
    "address": "97202",
    "link": "https://pdxparent.com/directory/portland-education-collab/",
    "website": "http://pdxeducationcollab.com",
    "facebook": "http://facebook.com/pdxeducation",
    "description": "Portland Education Collab is excited to present summer programs for learning pods and families!\n\nWeekly Day Camps\n\nOutdoor adventures and exploration in neighborhood parks and greenspaces. Available for existing pods or for kids looking to join a pod in their neighborhood.\n\nAvailable weekly (Mon-Fri) from June 14 through September 3. Camp runs from 8:00 AM – 3:30 PM each day..\n\nWeekend Family Adventures\n\nWant to explore your surroundings but don’t know where to start? Is the tedium of planning a weekend camping trip overwhelming? Do you just want to enjoy the trip along with your kids and have someone else be in charge of the heavy lifting? We got you. Let us provide a guide, gear, and all the planning necessary for weekend adventure!\n\nAvailable weekends (Fri-Sun) from June 18 through August 29.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2021/04/pdxeducationcollab_1-1-scaled.jpg"
    ]
  },
  {
    "title": "Realms Adventures",
    "link": "https://pdxparent.com/directory/realms-adventures/",
    "website": "https://realmsadventures.com/youth/camps/realms-summer-camp",
    "description": "Co-create the story in our epic role-playing adventure camp. Create your own character, becoming an Elf, Wizard, Ranger, and more. Then join friends on a magical adventure. The fate of the Realms lies in your hands!\n\nRealms is an experiential education program that is rooted in the idea that youth are capable of great things. We are team of compassionate individuals who believe kids (and adults) should have fantastic adventures in the natural world.\n\nRealms Camps and Adventures inspire kids and teens to become the Heroes of their own story. Our immersive programming seek to empower youth through storytelling, imagination & leadership skills.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/01/Cover-photo-3.jpg"
    ]
  },
  {
    "title": "Ekone Summer Camps",
    "address": "401 Ekone Road",
    "link": "https://pdxparent.com/directory/ekone-summer-camps-2/",
    "website": "http://www.ekone.org",
    "facebook": "https://www.facebook.com/ekoneranch",
    "description": "Ekone Ranch offers a one-of-a-kind camp program on over 1,000 acres of canyonlands, forests and meadows near the Columbia Gorge. Our residential, co-ed camp program features small groups and a high staff to camper ratio.\n\nHorse camp sessions emphasize the special relationship between children and horses. Campers spend many hours each day with our wonderful horses, grooming, learning groundwork, practicing in the arena, and going on long trail rides through spectacular country. We ride bareback and western. When not with the horses, campers are engaged in a variety of art projects, nature explorations, swimming, ranch activities and chores.\n\nWe also offer many other camp programs including Arts Outside Camp, Music Camp, Ranch Camp, Rites of Passage Camps for teens and Wilderness First Aid Camp. Each camp is unique and tailored to the specific group of campers each week.\n\nOur garden-fresh, from-scratch food is a highlight of the camp experience (many a camper has learned to love their vegetables in the Yummy Tummy Cafe). Campers sleep in our new bunkhouse (built in 2019), under the stars, or on very special occasions in the barn near the horses!\n\nAll of our sessions emphasize creating a supportive camp community, healthy peer relationships, and a positive work ethic. Campers have an unforgettable immersion experience in healthy lifestyles, good eating, and great friends. They learn that good work can be great fun, and they come back year after year for more!\n\nPlease visit our website at www.ekone.org or call 509-773-4536 for more information.\n\nFacilities description:\nEkone's facilities are full of rustic character and charm!\n\nThe spacious octagonal Lodge greets all visitors when they arrive in the Ekone valley. The first thing you notice is the giant hole in the ceiling...which allows us to have campfires “inside”! The Lodge also holds our craft area, tack room, and ranch offices.\n\nMost campers sleep in the Bunkhouse, which is an A-frame structure with lower bunks and upper lofts. Kids eyes go wide when they see this place! One each end of the bunkhouse are what we lovingly call ‘staff dens’, where there are always at least two staff members on-call all night long.\n\nThe Yummy Tummy Cafe is our scrumptious camp kitchen, that cranks out delicious, abundant, from-scratch meals for all, highlighting fresh produce from our own garden and from area farms. We eat as much organic and local food as possible.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/02/canyon1-scaled.jpg"
    ]
  },
  {
    "title": "Evergreen Aviation & Space Museum Aerospace Camps",
    "address": "500 NE Capt. Michael King Smith Way",
    "link": "https://pdxparent.com/directory/evergreen-aviation-space-museum-aerospace-camps/",
    "website": "https://www.evergreenmuseum.org/education/summer-camps/",
    "facebook": "http://facebook.com/evergreenmuseum",
    "instagram": "http://@evergreenmuseum",
    "description": "The best aerospace camps in the Pacific Northwest are back!\n\nOur interactive one-week programs are filled with exciting, educational experiences designed to engage 3rd – 9th graders.\n\nEvergreen Aviation & Space Museum aerospace camps will ignite a passion for exploration, innovation, and STEAM in future aviators and space explorers.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/04/EAM-logo_PMS5463.png"
    ]
  },
  {
    "title": "Experiment PDX Summer Camps",
    "address": "Experiment PDX, Southeast Stark Street, Portland, OR, USA",
    "link": "https://pdxparent.com/directory/experiment-pdx-summer-camps/",
    "website": "http://experimentpdx.com",
    "facebook": "https://www.facebook.com/ExperimentPDX",
    "instagram": "https://www.instagram.com/p/CfIEe-dD4j5/",
    "description": "Experiment PDX is SE Portland's newest venue for all things STEAM! This summer, we'll be hosting summer camps in partnership with local educators, artists, the PDX Insectarium, and Mad Science! Camps range from grades K-8 with something for every kiddo and feature both half-day and full-day camps.  Week-long camps start on July 5th and run through the end of August!\n\nExperiment PDX Summer Camp Registration Raffle\n\nEvery time you complete a camp registration, you’ll be entered into our raffle for a chance to win two free workshop tickets (any age) or a free birthday party for up to 10 children! (valid at Experiment PDX or the Portland Insectarium)\n\nCamp Contact Info: Molly Radany | curious@experimentpdx.com\n\nLego Learning Camp\n\nClassic LEGO construction meets modern learning! Explore engineering, basic coding, and build creativity through LEGOs and Intelligent Hardware. Creative tech and hands-on projects will excite your child and expand their teamwork skills!\n\nJunior Da Vinci Art Camp\n\nStudents will experience hands-on art history, work with various materials and traditional techniques, and learn about spacial skills through geometry, perspective, shading, and texture. All camps are tailored to age level and materials are provided - includes a personal sketchbook and a take-home final project masterpiece!\n\nCurious Colors - Science, Art, and Light Camp\n\nPrisms, paints, lasers & illusions - experiment, play, and create! Explore the spectrum of light, learn principles of color and rainbows. Create natural dyes, learn painting techniques, and experience illusions that will inspire your junior scientist’s curiosity!\n\nMad Science of PDX and Vancouver\n\nMad Science is partnering with Experiment PDX to offer a variety of STEAM summer camps. From chemistry and engineering to archaeology and inventions, find the perfect science experience for all young investigators!\n\nMad Science Junior Science Explorers 1 & 2\n\nDecipher the world all around us - campers will develop their earth awareness and explore the world as junior naturalists before heading for space as junior astronauts. Campers will also explore just why their big toe is important and how to find their center of gravity as they investigate the science of space!\n\nMad Science Moving with Science\n\nJoin the Mad Scientist in a fun-filled exploration of how science keeps our world moving. Take a close-up look at a wide array of scientific disciplines including chemistry, biology, engineering, physics, and optics. Take apart owl pellets to see what they cannot digest! Join a team of camper engineers and build bridges, domes, cubes, and pyramids. Make your own sidewalk chalk, crystal garden, and a chromatography-dyed T-shirt!\n\nMad Science Creative Contraptions\n\nEureka! Creativity and Innovation abound! Junior inventors explore the real-life inventions of DaVinci, Edison, and the Wright Brothers to Isaac Asimov's dreams of future inventions. Each day campers are given a series of challenges that must be overcome using basic materials, simple machines, tips from famous inventors, and the most important thing of all - their minds. They'll construct catapults and forts, fabricate innovative flying contraptions, design their own gizmo prototypes and will assemble a glowing sword!\n\nMad Science Underground Explorers\n\nLearn about archaeology and the techniques scientists use to excavate long-lost cities! Discover ancient civilizations and the tools and artifacts they use in everyday life! Study bone fragments, pottery shards, amber deposits, and fossils to understand what they can tell us about history. What's more, each class includes a make-and-take-home project like a fossil replication, an amber time capsule, and coins from around the world. \n\nRegister your child for the summer of a life-time!  Two half-day camps can be paired which allows your child to experience art, science, and learning from 9am-4pm with a supervised lunch hour in between! ",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/06/Summer-Camp-Promo-2.jpg"
    ]
  },
  {
    "title": "Independent Publishing Resource Center (IPRC)",
    "address": "318 SE Main St.",
    "link": "https://pdxparent.com/directory/iprc/",
    "website": "https://www.iprc.org/education/summer-youth-camps/",
    "facebook": "https://www.facebook.com/IPRCPDX/",
    "instagram": "https://www.instagram.com/iprc_pdx/?hl=en",
    "description": "The IPRC's mission is to provide affordable access to space, tools, and resources for creating independently published media and artwork, and to build community and identity through the creation of written and visual art. We nurture collaboration, creativity, and community-building through access to shared print-studio space, educational programming, and community events for writers, artists, printmakers, organizers, and small publishers. We provide equitable access to tools, resources, and unconditional support for Portlanders to share the stories & causes closest to their hearts through the production of independently-published zines, prints, chapbooks, art books, chapbooks, prints, and print ephemera. The IPRC exists to demystify print & publishing processes, and remove barriers to creative expression.\n\nShow:Tell Youth Camps are week-long offerings for Middle Grades and High School Artists and Writers, with opportunities to learn, explore, and make Comics, Zines, Screenprints, Letterpress Prints, Bookarts and Creative Writing with IPRC Teaching Artists. Registration includes a year of IPRC Membership to encourage print & zine-making all year long.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/05/showtellcamps-slider_subtle-melon.png"
    ]
  },
  {
    "title": "NW FILM CAMP",
    "address": "4033 SW Canyon Rd, Portland, OR, USA",
    "link": "https://pdxparent.com/directory/nw-film-camp/",
    "website": "https://www.nwfilmcamp.com",
    "instagram": "https://www.instagram.com/cherrystreetfilms",
    "description": "Summer Filmmaking at the World Forestry Center Portland Starts August 2nd, 2021\n\nGet the kids out of the house, off the screens and behind the camera! Our project based, in-person and online programs are the perfect Summer activity for aspiring filmmakers and content creators. NW Film Camps provide 10:1 student/teacher ratio featuring personalized instruction and peer to peer learning in a supportive, inclusive, covid safe, social environment.\n\nNW FILM CAMP is proud to partner with the World Forestry Center at Washington Park this Summer!\n\nThis bucolic campus is also home to the Oregon Zoo, Hoyt Arboretum & Portland Japanese Garden.\nJoin us at Washington Park the Summer! NW Film Camp is located at 4033 SW Canyon Rd, Portland, OR 97221\n\nDay Camp: Monday through Friday - 8:30am - 3pm Starting at $350 a week. Students Ages 11 through 17 are encouraged to enroll. Limited Space - Enroll Today.\n\n-\n\nOur in person and online camps are fun and creative project based programs designed to teach teamwork and collaboration. Activities range from production planning, location scouting, hands on tech and gear tutorials, introduction to industry standards, screenwriting, project management and so much more. These young media creators work in small teams or independently to produce short films to share with their communities, and beyond! We will be following all CDC, state and local guidelines regarding Covid-19 to ensure that all campers remain safe & healthy this Summer.\n\nSAMPLE SCHEDULE\n8:30 - Drop off / Check in\n9:00 - Instruction / Pre-production\n10:30 - Onset Film Production\n12:00 - Lunch Break - Bring a lunch!\n12:30 - Team Building Outside\n12:45 - Continue Filming\n1:30 - Post-production work\n2:30 - Pick up - No later than 3:00pm",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2021/04/40849-1-scaled.jpg"
    ]
  },
  {
    "title": "Shooting Star Adventures",
    "link": "https://pdxparent.com/directory/shooting-star-adventures/",
    "description": "Day camps, overnight camps, classes and more. Whether you are a homeschooling parent looking for support, a scout group that needs help on their next badge, a parent looking for a great summer camp or just a group of friends looking for a Saturday adventure – let Shooting Star help.\n\n2022 Day Camps include:\n\nNature and Art Engineering\n\nDo your kids love painting, creating art, building contraptions and exploring nature? Let us provide an outlet for their exploration and we will even clean up the mess! With some basic skills and a little imagination, campers will create nature inspired different art and craft projects.\nThey will engineer sticks, logs and other natural objects into useful and fantastical contraptions. What can be built with wood, rope and a little imagination? At this camp, just about anything!\n\nWilderness Skills\n\nYour child will learn real-life wilderness skills to use the next time your family goes camping. They’ll build and light a fire with and without matches, learn to tend a fire safely and create delicious campfire snacks.\nCampers will build shelters and create fun and practical wilderness tools.\nIn this fun interactive day camp, we’ll teach knife safety, wilderness navigation techniques, native plant identification and basic wilderness first aid while emphasizing teamwork, communication and decision making skills.\n\nJr. Naturalist\n\nEach day Junior Naturalist Campers will spend their time outside, having a great time observing nature up close using tools like binoculars, magnifying lenses and microscopes.\nScience concepts are introduced in a fun environment, with crafts, games and hands-on activities. We’ll teach leave no trace, wilderness navigation techniques, and native plant and animal identification while emphasizing teamwork, communication and decision making skills.\n\nMini Stars - Preschool Exploration\n\nAs preschoolers get older, they begin to think about things beyond their own experiences. Mini Stars Day Camp is designed to allow our youngest adventurers to explore the wide world around them.\nTheme weeks filled with songs, crafts and games all geared for little hands and minds allow for discovery of the wonders of nature and the outdoors. Curiosity, teamwork, and creativity abound in this outdoor focused camp series for ages 4-7.\n\nOther 2022 Classes/Events:\n\nCamping 101, Outdoor Cooking Demos, Guided Hiking, Archery, Family Campouts, Girls Weekend and more.\nSee our website for more detailed information on each program.\n\nWe aim to help bring our community closer to nature through day camps, nature walks, presentations and more. Time in nature allow us to break free from the everyday stresses of modern life. Nature gives us strength. Strength in our connections to the world around us, strength in our relationships and strength in ourselves. Your next adventure is waiting and the wild is calling – let Shooting Star Adventures be your guide to the fun.",
    "images": []
  },
  {
    "title": "Vibe of Portland",
    "link": "https://pdxparent.com/directory/vibe-of-portland/",
    "description": "Vibe of Portland is offering both half-day and full-day camps this summer, held in-person and with COVID-19 safety precautions. Vibe's summer camps encourage imaginative thinking and inspire your child to look at the world from new perspectives, through art! Campers learn a variety of techniques, hone their artistic skills, and develop friendships. Vibe offers a variety of subjects, from mixed media, illustration and drawing, environmental-based art, creating art from the world around us, and more! For music fans, Vibe is offering a musical theater camp for all levels, and a flute and clarinet camp for grades 6-10.\n\nVibe is an Art and Music educational nonprofit committed to ensuring equitable access to quality arts education experiences for long-term positive growth and is currently reimagining their in-person arts education offerings when all emerge from this global pandemic. They are fortunate to be able to offer in-person summer camps on sites with plenty of outdoor, and indoor space. Vibe's instructors are vaccinated, and masks are to be worn by all, teachers and students.",
    "images": []
  },
  {
    "title": "Summer Sing",
    "address": "11695 Southwest Park Way, Portland, OR 97225, USA",
    "link": "https://pdxparent.com/directory/summer-sing/",
    "website": "https://www.orsingers.org/youth-choir/summer-sing",
    "facebook": "https://www.facebook.com/OregonRepertorySingers",
    "instagram": "https://www.instagram.com/orsingers/",
    "description": "Spend your summer singing with friends and keeping your music skills sharp. Through games and activities, movement, and rehearsal time, campers will learn to read and sing music all while having fun. Join us! Each Summer Sing camp culminates with a final performance and party for all participants and their families to showcase the creativity and music created during the week.\n\nMeet Summer Sing's new camp director, Coty Raven Morris!\nhttps://www.youtube.com/watch?v=Yq6XHEAUb5M\n\nFinancial Aid and Special Discounts Available!\n\nSummer Sing is presented by the Oregon Repertory Singers Youth Choir (ORSYC) program directed by Aubrey Patterson. Make music a part of your child's life year-round. Learn More. ",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/02/WB-SummerSing-Instagram-1.jpg"
    ]
  },
  {
    "title": "Catlin Gabel School Summer Camps",
    "link": "https://pdxparent.com/directory/catlin-gabel-school-summer-camps/",
    "description": "Campers from across the Portland metro area are invited to Catlin Gabel's 67-acre wooded campus, which is conveniently located minutes from downtown, to enjoy a range of activities, including sports, academics, technology, arts, and more, as well as day camps. Different camps are available each week for campers from preschool to high school and run from June 27-August 12, as well as a range of options from partner camps hosted on our campus. Extended care is available in the mornings and afternoons for campers between 4-14 years of age. Register today at catalin.edu/summer!\n\nDay Camps\nOur Day Camps are designed for three specific age ranges: Summer Beehive (4-6 years old), Honey Hollow Adventure (6-9 years old), and Explorers (9-11 years old). Each session includes exploration, outdoor play, and creation. Campers are invited to come learn, play, and have fun with us. These camps, which run each week, typically fill up quickly.\n\nSports Camps\nWe offer a variety of sports camps for campers ages 6 to 18. Sports camps include basketball skills and fencing, as well as a sports spectacular camp, where lots of different activities are part of the day, depending on participant interests. More sports activities are available through partner camps. Go to our camp listings to see specific weeks and ages.\n\nArts and Activities Camps\nCampers can choose from camps that focus on photography, drawing, or making science-based art (indoors and in nature) to paper marbling, book making, jewelry making, crafting, and DJing (ages 10-14). For campers looking to explore outside, there is a weeklong farm experience on Sauvie’s Island (ages 7-11). Go to our camp listings to see specific weeks and ages.\n\nAcademic and Tech Camps\nTake a camp to expand skills or delve into hands-on explorations and experiments (ages 9-17). Summer is a great time for rising seniors to get started on college essays or for younger campers to explore different writing genres or how math is used in real life (math camp is online). Campers can also build rockets, light sabers, or create art using simple mathematical techniques. Go to our camp listings to see specific weeks and ages.\n\nAll Camps: Extended Care\nExtended care is offered mornings (7:30-9 a.m.) and afternoons (3-6 p.m.) for both Catlin Gabel and partner camps. Care is available for campers 4-14 years of age. To ensure adequate staffing, weekly sign-up is required. Campers may choose mornings, afternoons, or both. Please note that the sign-up is separate from that of the camps.\n\nPartner Camps\nCampers can also sign up for activities hosted on Catlin Gabel’s campus but run by other organizations. This year, we welcome Yoga Playgrounds, Bernie Fagan Soccer, Anthony Newman, Avid for Adventure, and Engineering for Kids.",
    "images": []
  },
  {
    "title": "Soccer Shots",
    "address": "818 SW 3rd Avenue",
    "link": "https://pdxparent.com/directory/soccer-shots/",
    "website": "https://www.soccershots.org/pdx/",
    "facebook": "https://www.instagram.com/soccershotspdx/",
    "instagram": "https://www.instagram.com/soccershotspdx/",
    "description": "PORTLAND'S PREMIER YOUTH SOCCER PROGRAM!\n\nSoccer Shots Portland is an engaging children’s soccer program with a focus on character development. Our caring team positively impacts children’s lives on and off the field through best-in-class coaching, communication and curriculum. Our coaches are the best-trained in the business. Our expert-approved curriculum is age-appropriate and aligns with childhood education standards. In addition we provide an exceptional customer experience and ongoing communication with parents.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2021/02/logo-fullcolor-v1.png"
    ]
  },
  {
    "title": "My Gym Children’s Fitness Center – Happy Valley",
    "link": "https://pdxparent.com/directory/my-gym-childrens-fitness-center-happy-valley/",
    "description": "My Gym offers super fun classes, camps, Parents' Night Outs, private birthday parties and more for ages 4 months to 10 years old.",
    "images": []
  },
  {
    "title": "Sauvie Island Center Farm Camp",
    "link": "https://pdxparent.com/directory/sauvie-island-center-farm-camp/",
    "description": "Join us on the farm for fun and exploration at Farm Camp.\n\nCome for spring break or spend a whole week exploring the farm in the farm this summer. At the Sauvie Island Center's Farm Camp children spend their days exploring beautiful  Topaz Farm, while soaking up the fresh air and learning about the natural world. Each day at camp is a new adventure as we investigate the science behind how our food grows.\n\nSpring break camp begins Tuesday, 3/22  and runs through Friday, 3/25.  Each day will offer a different theme. Campers can participate in a single day, or register for all four and receive a discount.\n\nDay 1: March 22 – Food Web Through food webs, all living things are interconnected. Students will gain an understanding of the food web (producers, consumers, and decomposers), and recognize that all living things get their energy from the sun.\n\nDay 2: March 23 – Plant Parts and Seed to Harvest Campers will learn about all six parts of the plant, including their function, how to identify each part, and which parts we eat on various plants. Through these lessons campers will learn about the life cycle of plants from seed to harvest!\n\nDay 3: March 24 – Soil and Compost Students investigate the four elements of healthy soil (water, air, organic materials, minerals), and meet the residents of a vermi-compost bin!\n\nDay 4: March 25 (Family Day): Dig in to all SIC curriculum topics and the interconnectedness of nature We will cover pieces of each of our lessons in the morning. After a lunch break we will spend the afternoon exploring the garden and creating garden-themed arts and crafts near by.\n\nSummer camp runs Monday, 7/18 - 7/22 and  again Monday, 7/25 - 7/29.  Through traditional camp activities—like games, camp songs, arts and crafts and more—we’ll focus on different parts of the Sauvie Island Center curriculum including:\n\nSoil Exploration: Dig in and learn about healthy soil.\nSeed to Harvest: Plant, tend and harvest the Grow Lunch Garden.\nPlant Parts Investigation: Explore the farm and plants we can eat.\nWildlife & Food Web: Who else has been foraging on the farm?\nPollination Station: Meet these hard-working farm friends.",
    "images": []
  },
  {
    "title": "Concert School of Music",
    "link": "https://pdxparent.com/directory/concert-school-of-music/",
    "description": "Our goal at Concert School of Music is to provide high quality music instruction in a supportive environment. We strive to challenge each student to their fullest, while providing motivation to help them achieve their goals.\n\nWe offer private lessons on piano, guitar, voice, violin, viola, cello, double bass, clarinet, flute, recorder, saxophone, drums, composition, banjo, mandolin, & ukulele. We also offer group lessons including rock band, chamber groups, string orchestra, and more.",
    "images": []
  },
  {
    "title": "Skate Like a Girl Summer Camp",
    "link": "https://pdxparent.com/directory/skate-like-a-girl-summer-camp/",
    "description": "Skate Like a Girl\n\nAll-gender and girls weeks\n\nMonday - Friday\n\nAll skill levels welcome, ages 6+\n\n7 different locations!\n\nMore information at www.skatelikeagirl.com",
    "images": []
  },
  {
    "title": "Hipbone Art Studio",
    "link": "https://pdxparent.com/directory/hipbone-art-studio/",
    "description": "Summer art camps  for teens ages 13 to 17 where they will experience and learn traditional drawing and painting methods.\n\nhttps://www.hipboneartstudio.com/summer-camps.html",
    "images": []
  },
  {
    "title": "Imagine Theatre",
    "address": "13203 SE 172nd Ave Suite 166",
    "link": "https://pdxparent.com/directory/imagine-theatre/",
    "website": "http://www.imaginetheatre.org",
    "facebook": "https://www.facebook.com/imaginetheatrepdx",
    "instagram": "https://www.instagram.com/imaginetheatrepdx/",
    "description": "Originating with virtual-programming in Fall 2020, Imagine Theatre offers intentional programming for students ages 7-18 in the areas of dance, voice, acting, comedy, musical theatre and technical theater. Students explore these themes through our educational offerings (classes, workshops, camps, etc.) and performance opportunities (Mainstage offerings, and education rooted performance opportunities.)\n\nEducation - Classes, Camps, & Leadership\n\n- Classes -\n\nFor students 7-18, Imagine offers educational programming on a quarterly basis. During our Fall, Winter, & Spring terms, students can register for classes based in the the themes of dance, voice/music, acting, musical theatre, comedy, and technical theatre. Classes are an intentional place for students to grow deep in what they love. Our three core classes (Voice Core, Dance Core, and Acting Core) are the root of all other classes. Most of the other classes offered require one or more the Core classes having been already taken.\n\n- Camps  -\n\nFor students 7-18, Imagine offers a wide variety of summer programming that includes Camps, Intensives, and Workshops. Imagine camps are one of the best ways to first engage with the programming, as they are packed with tons of fun, learning, performances, and skilled teachers. With week-long, two-week, and evening-only offerings, there is something for everyone to enjoy!\n\n- Artists Committed to Serve (ACTS)  -\n\nFor High school students, Imagine Theatre offers an intentional leadership program (ACTS) that empowers and guides student leaders in creating a strong community amongst all Imagine students and creating ways to meaningfully engage with the larger community around us. The ACTS team does all of this while engaging in learning about what it means to be good leaders through learning about communication styles, leadership styles, ethical leadership, community-development, organizational strategies, marketing, communications, and more.\n\n- Teaching Artists  -\n\nOur educational offerings are taught by skilled and experienced Teaching Artists. Many of the Imagine Theatre Teaching Artists work in the theatre/art/music field, are professional artists, and/or hold relevant degrees/certificates in theatre, education, music, etc.\n\nPerformance - Mainstage, The Studio\n\nImagine Theatre offers unique and meaningful performance opportunities through our Mainstage & The Studio programs.\n\n- Mainstage -\n\nImagine Theatre's Mainstage program offers a stage experience for larger shows and performers of any level.\n\n- The Studio -\n\nImagine Theatre's The Studio program is an intentional performance based-learning program that offers unique projects for students seeking ways to experiment, grow, and learn as artists.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2021/05/80711647_10156575093906541_784320337452990464_n-2.jpg"
    ]
  },
  {
    "title": "Evergreen Aviation & Space Museum Aerospace Camps",
    "address": "500 NE Capt. Michael King Smith Way",
    "link": "https://pdxparent.com/directory/evergreen-aviation-space-museum-aerospace-camps/",
    "website": "https://www.evergreenmuseum.org/education/summer-camps/",
    "facebook": "http://facebook.com/evergreenmuseum",
    "instagram": "http://@evergreenmuseum",
    "description": "The best aerospace camps in the Pacific Northwest are back!\n\nOur interactive one-week programs are filled with exciting, educational experiences designed to engage 3rd – 9th graders.\n\nEvergreen Aviation & Space Museum aerospace camps will ignite a passion for exploration, innovation, and STEAM in future aviators and space explorers.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/04/EAM-logo_PMS5463.png"
    ]
  },
  {
    "title": "Art Literacy Academy",
    "link": "https://pdxparent.com/directory/art-literacy-academy/",
    "description": "Art Literacy Academy provides  after school enrichment programs , Saturday art classes and summer camps. Some lessons are now  available for parents and educators on the website/shop. The Art History based Art lessons for  young artists are step by step tutorials. The complete packages include a bio, facts about the artist, 3-5  lessons for each artist, and a Teacher's guide with links to additional resources. Sample lessons are available to view on the ALA website.\n\n www.artliteracyacademy.com\n\nFor further information about the in-person classes or summer camp please contact me through the website or at sepia84@hotmail.com. ",
    "images": []
  },
  {
    "title": "Guardian Games D&D Camp",
    "link": "https://pdxparent.com/directory/guardian-games-dd-camp/",
    "description": "Join Guardian Games to explore the world of Dungeons & Dragons 5th Edition – one of the greatest role-playing games of all time!",
    "images": []
  },
  {
    "title": "Realms Adventures",
    "link": "https://pdxparent.com/directory/realms-adventures/",
    "website": "https://realmsadventures.com/youth/camps/realms-summer-camp",
    "description": "Co-create the story in our epic role-playing adventure camp. Create your own character, becoming an Elf, Wizard, Ranger, and more. Then join friends on a magical adventure. The fate of the Realms lies in your hands!\n\nRealms is an experiential education program that is rooted in the idea that youth are capable of great things. We are team of compassionate individuals who believe kids (and adults) should have fantastic adventures in the natural world.\n\nRealms Camps and Adventures inspire kids and teens to become the Heroes of their own story. Our immersive programming seek to empower youth through storytelling, imagination & leadership skills.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/01/Cover-photo-3.jpg"
    ]
  },
  {
    "title": "River Ranch Summer Equestrian Day Camp",
    "address": "River Ranch",
    "link": "https://pdxparent.com/directory/river-ranch-summer-equestrian-day-camp/",
    "website": "http://www.RiverRanchHorses.com",
    "facebook": "http://RiverRanchHorses",
    "description": "River Ranch is offering Summer Day Camps in 2022 tailor made to your child’s needs. Day Horse Camps and Half Day Pony Camp sessions will be available Monday -Friday from June through August. Camp curriculum will include learning to care for, lead, groom and tack your horse, riding instruction in flatwork and equitation, riding demonstrations, as well as information given on horse care, riding theory and safety techniques. Horses, Ponys and equipment are provided by River Ranch. Our groups are very small, only 7-8 kids per week with all campers enjoying the responsibility of caring for and learning to love a horse or pony for the week.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/03/Screen-Shot-2022-03-21-at-8.38.23-PM.png"
    ]
  },
  {
    "title": "Code Galaxy – Online Coding Classes for Kids",
    "link": "https://pdxparent.com/directory/code-galaxy-online-coding-classes-for-kids/",
    "description": "Code Galaxy\n\nCode Galaxy offers the best online coding summer camps for kids nationwide. We also offer online weekly coding classes and private tutoring to kids. We offer courses on game development, design, web development, Python programming, and other STEM-related programs. Our coding classes are designed for kids to develop valuable programming skills to equip them for their careers. From Scratch + Minecraft to Python Programming and Web Development, our coding camps for kids are the perfect way to spend time off school. Sign up with Code Galaxy today and learn why we are the coding school parents and kids love the most!",
    "images": []
  },
  {
    "title": "Tucker Maxon School",
    "link": "https://pdxparent.com/directory/tucker-maxon-school/",
    "description": "Tucker Maxon School is a parent's first choice for an outstanding preschool-to-5th grade education with a focus on communication, academics and emotional intelligence. Small classes (1:8 average) allow our dedicated teachers to focus their attention on your child. Every preschool class has two teachers. Highlights include daily PE, art, music, a huge playground and rock-climbing wall, organic garden, goats, and a summer arts camp. Founded in 1947, Tucker Maxon is an OPTION-accredited school “Where Every Child Has a Voice.” Enrollment for fall starts March 1. Come take a virtual tour soon!\n \nTucker Arts Camp travels the world from June 28 - August 20 this summer. Over the course of eight weeks, children explore the art of storytelling through music, movement, visual arts and more from diverse countries around the world at our beautiful SE Portland campus. Our campus offers a large organic garden, tree house, chickens, goats, and plenty of space for children to be inspired by the natural world and enjoy fun in the summer sun. See weekly schedule at https://www.tuckermaxon.org/tuckerartscamp/. Financial Aid available.",
    "images": []
  },
  {
    "title": "First Tee – Greater Portland",
    "address": "19825 River Road, Gladstone, OR, USA",
    "link": "https://pdxparent.com/directory/first-tee-greater-portland-2/",
    "website": "https://firstteegreaterportland.org",
    "facebook": "https://www.facebook.com/FirstTeePDX/",
    "instagram": "https://www.instagram.com/firstteepdx/?hl=en",
    "description": "Join our 3 Day Summer Golf Camps at The Campbell Course!\n\nFirst Tee - Greater Portland is a youth development organization with a purpose of introducing the game of golf and its inherent life values to young people through accessible and affordable education opportunities. Our summer golf camps are a fun way to be a part of our traditional Life Skills Experience in a unique way!\n\nDetails\n\nWho? Youth ages 7 and up. We welcome all experience and skill levels! Special camps offered for 5-6 year olds in a condensed format.\n\nWhere? The Campbell Course - Home of the Children's Course\n\nWhen? Camps run in 3 day increments from 9am-1pm each day\n\nPrice? Financial aid is always available and all equipment is provided.\n\nPlease visit our website for further details and for registration information.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/02/First-Tee-Image.jpg"
    ]
  },
  {
    "title": "Soulflags Art Lit/Community Center",
    "address": "504 Main Street, Oregon City, OR, USA",
    "link": "https://pdxparent.com/directory/soulflags-art-lit-community-center/",
    "website": "https://soulflags.org/",
    "facebook": "https://www.facebook.com/SoulflagsArtLit",
    "instagram": "https://www.instagram.com/soulflagsart/",
    "description": "AN ART COMMUNITY CENTER FOR ALL AGES!\n\nSoulflags Art Lit Community Center is a non-profit organization focused on creating an opportunity for youth and aspiring artists to be exposed to different art styles and art media. We aspire to become a source for the community, community organizations and schools a place to work and learn. Our mission is to promote artistic expression and entrepreneurship through our community workspace. Soulflags works hard to organize and host many community centered events and activities throughout the year for our community.\n\nSOULFLAGS SUMMER ART CAMP!!\n\nSoulflags is excited to announce Summer Art Camps for students of ALL AGES this June through August!! Camps will be a week long, 4 hours per day. Themed each week to a particular artist, students will be working with different art media that may include painting, photography, collages, tie-dye, batik, \"stained glass\", paper mache, clay and much more. Mornings will be for our younger grades and afternoons for the older grades. We look forward to the upcoming summer season and our first year of summer camp!\n\nARTISTS OF THE WEEK!\n\nJune 14-18: Javaka Steptoe\n\nJune 28-July 1: Man Ray\n\nJuly 12-16: Andy Warhol\n\nJuly 26-30: Piet Mondrian\n\nAugust 9-13: Dale Chihuly\n\nAugust 23-27: Georgia O'Keefe\n\n($140, limit of 8 students per group, scholarships available).\n\nWe are very much looking forward to a fun and enriching year for our students, families and staff.\n\nVisit www.soulflags.org or contact 503-405-9776 for membership and volunteer opportunities. Background check required.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2021/05/Soulflags-Summer-Art-Camp.jpg"
    ]
  },
  {
    "title": "Alpengirl Adventure Camp for Girls",
    "address": "7000 Northeast Airport Way Portland, OR",
    "link": "https://pdxparent.com/directory/alpengirl-adventure-camp-for-girls/",
    "website": "http://www.alpengirlcamp.com",
    "facebook": "https://www.facebook.com/AlpengirlCamp",
    "instagram": "https://www.instagram.com/alpengirlcamp/",
    "description": "Alpengirl is an overnight summer adventure camp for girls ages 11-16. Our 1 or 2 week outdoor camps are in the Pacific Northwest and Northern Rocky Mountains: Washington, Wyoming, Oregon, Idaho and Montana. We offer daily yoga, delicious camp food and tent camping combined with surfing, rafting, riding, climbing and more! ACA Accredited, small groups of 12 girls, 1:6 ratio. Cost: $1195-$3295 Ages Served: Ages 11 - 16 Dates: 16 different camps available, see website for specific dates.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2020/12/Alpengirl-M-Logo.jpg"
    ]
  },
  {
    "title": "Camp Two Roads",
    "link": "https://pdxparent.com/directory/camp-two-roads/",
    "description": "Camp Two Roads programming is designed to support women's empowerment and has been voted a Top 5 Overnight Camp by PDX Parent Readers 2 years in a row. Every girl leaves at the end of the week knowing someone believes in them!\n\nCamp Two Roads believes that outdoor happiness deepens awareness, kinship, and adventure.\n\nWe strive to provide the tools necessary to empower young women to be confident leaders both in the outdoors and within their communities. We work to broaden their horizon of possibilities so that they have the courage and ability to blaze their own roads in life.\n\nAn All Girls Camp\n\nGirls are more self-confident, open to new experiences and capable of forging deep lasting friendships in the comfort of an all-girls environment, free from the distractions of the opposite gender.\nGirls are encouraged to make decisions for themselves, to try new things, and to develop new passions.\n\nLiving Close to Nature\n\nCamp is a place for girls to disconnect from modern technology and immerse themselves in nature.\nGirls thrive when encouraged to make real connections with their peers.\n\nAvenues of Adventure\n\nOut of the ordinary experiences allow girls to explore new talents and develop a more confident sense of self.  \nEach girl is encouraged to boldly embrace challenges and to simply shine at being herself.\n\nWhere Every Girl Belongs\n\nWe value healthy competition, enthusiastic cooperation, kind communication and playful participation. \nCamp is a positive community where girls feel safe, supported, and valued.\n\nEvery girl leaves at the end of the week knowing someone believes in them!\n\nCampers develop confidence with outdoor skills such as knots/lashing, compasses and fire building. Also, they learn how to cook in the outdoors, study nature and build positive communication skills through teamwork challenges. We turn off the technology for a full week and exercise interpersonal skills.  Camp Two Roads is fun, safe and an important opportunity for young women to get to know themselves and the world around them.\n\nRecreation activities include, swimming and water sport, archery, arts and crafts, hiking and more. Each evening brings a full campfire program and optional late-night activities including a night hike, and an outdoor movie under the stars with popcorn or an all-camp dance.\n\nGive your girl the opportunity to have a week full of fun friendships and a lifetime of memories. ",
    "images": []
  },
  {
    "title": "Steve & Kate’s Camp",
    "address": "601 Northeast Cesar E Chavez Boulevard, Portland, OR, USA",
    "link": "https://pdxparent.com/directory/steve-kates-camp/",
    "website": "https://steveandkatescamp.com/portland/",
    "description": "When you trust kids, they trust themselves. \n\nSince 1980, Steve & Kate’s has put kids in charge of their own learning experience. They try, fail, and learn on their own. They learn to trust their own judgment and tackle the challenges of an ever-changing world with creativity and confidence.\n\nCampers choose minute to minute from a variety of activities including, sewing, stop-motion animation, music, sports & recreation, makers crafts, baking, and more. They'll decide what they want to do, and for how long. \n\nThis summer families can buy as many days as they’d like, and use them at any time. No weekly reservations required–just show up! \n\nLunch and snacks are included daily. Just like everything else here, kids will get to choose their entree from a variety of local vendors. We throw in healthy snacks and the occasional frozen treat to boot. \n\nAges 4-12\n\nAll Saints School, Portland\n\nportland@steveandkate.com\n\nLearn more at https://steveandkatescamp.com/portland/",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/02/Screen-Shot-2022-02-09-at-3.25.31-PM.png"
    ]
  },
  {
    "title": "Evergreen Aviation & Space Museum Aerospace Camps",
    "address": "500 NE Capt. Michael King Smith Way",
    "link": "https://pdxparent.com/directory/evergreen-aviation-space-museum-aerospace-camps/",
    "website": "https://www.evergreenmuseum.org/education/summer-camps/",
    "facebook": "http://facebook.com/evergreenmuseum",
    "instagram": "http://@evergreenmuseum",
    "description": "The best aerospace camps in the Pacific Northwest are back!\n\nOur interactive one-week programs are filled with exciting, educational experiences designed to engage 3rd – 9th graders.\n\nEvergreen Aviation & Space Museum aerospace camps will ignite a passion for exploration, innovation, and STEAM in future aviators and space explorers.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/04/EAM-logo_PMS5463.png"
    ]
  },
  {
    "title": "The Circus Project",
    "link": "https://pdxparent.com/directory/the-circus-project/",
    "description": "Circus summer camps at The Circus Project are highly physical, and also exercise your child’s creativity.  Students try out many new skills, as every day explores tumbling, trapeze, juggling, theater, dance and more.  This year we are offering camps at two locations - our beautiful, air-conditioned gym in NW Portland (9am-2pm), and an all-outside camp at the Circus Domes at Zidell Yards (9am-noon).  Spend your summer moving your body and making art!\n\nThere are camp offerings for ages 5-11.\n",
    "images": []
  },
  {
    "title": "Soccer Shots",
    "address": "818 SW 3rd Avenue",
    "link": "https://pdxparent.com/directory/soccer-shots/",
    "website": "https://www.soccershots.org/pdx/",
    "facebook": "https://www.instagram.com/soccershotspdx/",
    "instagram": "https://www.instagram.com/soccershotspdx/",
    "description": "PORTLAND'S PREMIER YOUTH SOCCER PROGRAM!\n\nSoccer Shots Portland is an engaging children’s soccer program with a focus on character development. Our caring team positively impacts children’s lives on and off the field through best-in-class coaching, communication and curriculum. Our coaches are the best-trained in the business. Our expert-approved curriculum is age-appropriate and aligns with childhood education standards. In addition we provide an exceptional customer experience and ongoing communication with parents.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2021/02/logo-fullcolor-v1.png"
    ]
  },
  {
    "title": "Circus Cascadia Summer Camp",
    "link": "https://pdxparent.com/directory/circus-cascadia-summer-camp/",
    "description": "Our camp allows children to get creative, move their bodies and have fun outdoors.  Many circus skills will be introduced in our beautiful Big Top.",
    "images": []
  },
  {
    "title": "Fir Acres Writing Workshop",
    "address": "Lewis & Clark College, SW Palatine Hill Rd, Portland, OR, USA",
    "link": "https://pdxparent.com/directory/fir-acres-writing-workshop/",
    "website": "http://go.lclark.edu/firacres",
    "description": "At Fir Acres Writing Workshop, up to sixty high school students from across the country come together for two weeks to write and join a community of writers on the beautiful, wooded campus of Lewis & Clark College in Portland, Oregon.\n\nIn daily Workshops, participants study great writing and produce their own under the guidance of dynamic, thoughtful, published faculty. At night, participants gather to socialize, meet and hear from distinguished visiting writers, and work on their own poetry, fiction, and creative prose.\n\nOur mission is to provide a high-caliber, pre-collegiate, creative educational experience to bright, inventive, and passionate high school students. Our program appeals to young writers and artistic students who are drawn to the beauty of the Pacific Northwest and the fun, hip mystique of Portland.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/02/L_CC_Sig_4cp.jpg"
    ]
  },
  {
    "title": "Speak and Be Heard Theater",
    "link": "https://pdxparent.com/directory/speak-and-be-heard-theater/",
    "description": "We are a theater company dedicated to bringing the joy of the theater to neurodiverse populations. We believe that everyone has a fundamental right to communicate and experience the world in a positive and meaningful way. Our camps and classes focus on teaching social skills, team work, and problem solving through the art of theater. Children gain valuable social skills and peer interactions through participating in our small group classes. Speak and Be Heard Theater is run by a certified Speech and Language Pathologist who has more than 14 years of experience working with neurodiverse populations including children with Autism, Down Syndrome, Intellectual Disabilities, and more.",
    "images": []
  },
  {
    "title": "River Ranch Summer Equestrian Day Camp",
    "address": "River Ranch",
    "link": "https://pdxparent.com/directory/river-ranch-summer-equestrian-day-camp/",
    "website": "http://www.RiverRanchHorses.com",
    "facebook": "http://RiverRanchHorses",
    "description": "River Ranch is offering Summer Day Camps in 2022 tailor made to your child’s needs. Day Horse Camps and Half Day Pony Camp sessions will be available Monday -Friday from June through August. Camp curriculum will include learning to care for, lead, groom and tack your horse, riding instruction in flatwork and equitation, riding demonstrations, as well as information given on horse care, riding theory and safety techniques. Horses, Ponys and equipment are provided by River Ranch. Our groups are very small, only 7-8 kids per week with all campers enjoying the responsibility of caring for and learning to love a horse or pony for the week.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/03/Screen-Shot-2022-03-21-at-8.38.23-PM.png"
    ]
  },
  {
    "title": "Sunset Church Kids Camp: Making Waves!",
    "link": "https://pdxparent.com/directory/sunset-church-kids-camp-making-waves/",
    "description": "Everyone is welcome to Sunset Church's 2022 Kids Camp. Join us as we discover how following Jesus makes waves that changes the world around us.",
    "images": []
  },
  {
    "title": "Triskelee Farm",
    "address": "29700 SW Mountain RD",
    "link": "https://pdxparent.com/directory/triskelee-farm/",
    "website": "https://triskeleefarm.com/",
    "facebook": "https://www.facebook.com/Triskeleefarm",
    "instagram": "https://www.instagram.com/triskeleefarm/",
    "description": "Triskelee Farm is a small working farm that offers summer camps, farm tours, parties, a preschool, and more!\n\nDuring select weeks in July, we'll be offering summer camps for kids of all ages! They will focus on our farm animals like our goats, alpacas, and birds, we'll be going into the garden and taking lots of nature walks. Camps will include nature crafts, learning about farming, and where our food comes from.\n\nCome experience farm life by reserving a guided educational farm tour that takes you up close and personal with our lovely farm animals. Our working farm raises animals for eggs, milk, fiber, and meat. We have alpacas, goats, ostriches, peacocks, and more. You'll even get a chance to feed some! Adults can make it a Tipsy Tour! We offer beer and wine from local vineyards and breweries to take with you on the tour.  See our website to book a tour. https://triskeleefarm.com/farm-experiences\n\nWe are here to share our farm with you and teach you where our food comes from. Because food doesn't come from the store, it comes from a farmer! Triskelee Farm began as a mere wish and then it came to fruition in 2018. The name Triskelee is derived from the ancient Celtic symbol Triskele meaning things of three. Such as past, present, and future. For us, it represents the three generations of our family that all came together to learn how to farm and live together. We had no farming experience when we started this journey we just knew we wanted our children to be close to their extended family and have an outdoor environment to grow up in.\n\nCheck out our new Triskelee Sprouts Farm School at triskeleesprouts.com ",
    "images": []
  },
  {
    "title": "Ekone Summer Camps",
    "address": "401 Ekone Road, Goldendale, WA, USA",
    "link": "https://pdxparent.com/directory/ekone-summer-camps/",
    "website": "http://www.ekone.org",
    "facebook": "https://www.facebook.com/ekoneranch",
    "description": "Since 1986, Ekone has been a home to children in the summertime.  At Ekone, campers experience being an important member of an inclusive community, in relationship and service to a place.  We believe that this experience is fundamental to our human nature, transformative for those who experience it, and essential to creating a viable, vibrant future on Earth. \n\nAnd fun!  If there's anything Ekone is known for, it's finding the fun in everything. \n\nDays at camp are spent almost entirely outside, with a community of 25-30 children aged 8-18, and a crew of 10-15 staff and mentors aged 16-80.  Together, we engage in play, work, skill-building, and activities designed to connect us to nature, each other, and ourselves.  We learn to listen closely to the birds.  We stalk the deer at the pond.  We create art from found objects.  We run wild through the woods.  We shed some of the busy-ness of modern life and remember how to make our own fun.\n\nWe also care for the needs of our place and community, taking responsibility for ourselves and our shared experience.  We cook meals, clean up after them, tend the garden, feed the animals, buck hay, haul firewood, and engage in conservation projects on the land.  We learn to listen to each other, speak our truth with kindness, and create the kind of community we want to live in.\n\nAnd we simply enjoy life on the ranch.  Campers sleep in the rustic A-frame bunkhouse or under the stars.  Our wholesome, delicious meals are cooked from scratch, and most of our produce is from Ekone's own garden.  We take a break from screens, mirrors, makeup, competition, and drama.  We swim in the pond, swing on the rope swings, catch frogs, and build forts. \n\n​This year we will be providing both Family Camps and some overnight camps for teens. Family Camps will provide day-camp style activities during the day for kids, with shared family meals and plenty of time together as well. ",
    "images": []
  },
  {
    "title": "Camp Two Roads",
    "link": "https://pdxparent.com/directory/camp-two-roads/",
    "description": "Camp Two Roads programming is designed to support women's empowerment and has been voted a Top 5 Overnight Camp by PDX Parent Readers 2 years in a row. Every girl leaves at the end of the week knowing someone believes in them!\n\nCamp Two Roads believes that outdoor happiness deepens awareness, kinship, and adventure.\n\nWe strive to provide the tools necessary to empower young women to be confident leaders both in the outdoors and within their communities. We work to broaden their horizon of possibilities so that they have the courage and ability to blaze their own roads in life.\n\nAn All Girls Camp\n\nGirls are more self-confident, open to new experiences and capable of forging deep lasting friendships in the comfort of an all-girls environment, free from the distractions of the opposite gender.\nGirls are encouraged to make decisions for themselves, to try new things, and to develop new passions.\n\nLiving Close to Nature\n\nCamp is a place for girls to disconnect from modern technology and immerse themselves in nature.\nGirls thrive when encouraged to make real connections with their peers.\n\nAvenues of Adventure\n\nOut of the ordinary experiences allow girls to explore new talents and develop a more confident sense of self.  \nEach girl is encouraged to boldly embrace challenges and to simply shine at being herself.\n\nWhere Every Girl Belongs\n\nWe value healthy competition, enthusiastic cooperation, kind communication and playful participation. \nCamp is a positive community where girls feel safe, supported, and valued.\n\nEvery girl leaves at the end of the week knowing someone believes in them!\n\nCampers develop confidence with outdoor skills such as knots/lashing, compasses and fire building. Also, they learn how to cook in the outdoors, study nature and build positive communication skills through teamwork challenges. We turn off the technology for a full week and exercise interpersonal skills.  Camp Two Roads is fun, safe and an important opportunity for young women to get to know themselves and the world around them.\n\nRecreation activities include, swimming and water sport, archery, arts and crafts, hiking and more. Each evening brings a full campfire program and optional late-night activities including a night hike, and an outdoor movie under the stars with popcorn or an all-camp dance.\n\nGive your girl the opportunity to have a week full of fun friendships and a lifetime of memories. ",
    "images": []
  },
  {
    "title": "Vibe of Portland",
    "link": "https://pdxparent.com/directory/vibe-of-portland/",
    "description": "Vibe of Portland is offering both half-day and full-day camps this summer, held in-person and with COVID-19 safety precautions. Vibe's summer camps encourage imaginative thinking and inspire your child to look at the world from new perspectives, through art! Campers learn a variety of techniques, hone their artistic skills, and develop friendships. Vibe offers a variety of subjects, from mixed media, illustration and drawing, environmental-based art, creating art from the world around us, and more! For music fans, Vibe is offering a musical theater camp for all levels, and a flute and clarinet camp for grades 6-10.\n\nVibe is an Art and Music educational nonprofit committed to ensuring equitable access to quality arts education experiences for long-term positive growth and is currently reimagining their in-person arts education offerings when all emerge from this global pandemic. They are fortunate to be able to offer in-person summer camps on sites with plenty of outdoor, and indoor space. Vibe's instructors are vaccinated, and masks are to be worn by all, teachers and students.",
    "images": []
  },
  {
    "title": "Write Now Portland – Creative Writing and Nature Play Camp",
    "address": "Mt Tabor Park, Southeast Salmon Street, Portland, OR, USA",
    "link": "https://pdxparent.com/directory/write-now-portland-creative-writing-and-nature-play-camp/",
    "website": "http://www.writenowportland.com/summer-camps.html",
    "description": "The Creative Writing and Nature Play Summer Camps are inspiring children to write again this summer. Children ages 8-12 will develop their own stories, play games and build a sense of community in these half-day outdoors writing camps. We focus on activating the five senses both in the writing and in the games we play, ensuring an exciting and experiential week for all.\n \nOne of our favorite quotes about this camp came from a 4th grade boy who said last summer, \"I woke up with a smile on my face every day just knowing that I got to come to this camp.\"\n \nYour child will develop writing skills, get exercise and have a great time expanding their creativity.\n \nOften children want to do the camp multiple times, to keep working on their story and to enjoy time out in nature. This camp is open ended and can be repeated.\n \nThe schedule can be found here:  http://www.writenowportland.com/summer-camps.html",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/02/metin-writing-outside_1-1.jpg"
    ]
  },
  {
    "title": "Code Galaxy – Online Coding Classes for Kids",
    "link": "https://pdxparent.com/directory/code-galaxy-online-coding-classes-for-kids/",
    "description": "Code Galaxy\n\nCode Galaxy offers the best online coding summer camps for kids nationwide. We also offer online weekly coding classes and private tutoring to kids. We offer courses on game development, design, web development, Python programming, and other STEM-related programs. Our coding classes are designed for kids to develop valuable programming skills to equip them for their careers. From Scratch + Minecraft to Python Programming and Web Development, our coding camps for kids are the perfect way to spend time off school. Sign up with Code Galaxy today and learn why we are the coding school parents and kids love the most!",
    "images": []
  },
  {
    "title": "Evergreen Aviation & Space Museum Aerospace Camps",
    "address": "500 NE Capt. Michael King Smith Way",
    "link": "https://pdxparent.com/directory/evergreen-aviation-space-museum-aerospace-camps/",
    "website": "https://www.evergreenmuseum.org/education/summer-camps/",
    "facebook": "http://facebook.com/evergreenmuseum",
    "instagram": "http://@evergreenmuseum",
    "description": "The best aerospace camps in the Pacific Northwest are back!\n\nOur interactive one-week programs are filled with exciting, educational experiences designed to engage 3rd – 9th graders.\n\nEvergreen Aviation & Space Museum aerospace camps will ignite a passion for exploration, innovation, and STEAM in future aviators and space explorers.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/04/EAM-logo_PMS5463.png"
    ]
  },
  {
    "title": "Cathedral Park Performing Arts Collective",
    "link": "https://pdxparent.com/directory/cathedral-park-performing-arts-collective/",
    "description": "Cathedral Park Performing Arts Collective is a nonprofit arts organization offering music and theatre classes, camps, and workshops for ages 7-17 in St. Johns! cathedralparkarts.org",
    "images": []
  },
  {
    "title": "Joy’s Art Studio",
    "link": "https://pdxparent.com/directory/joys-art-studio/",
    "description": "Fun in Hood River! Painting, drawing, watercolor, collage, and printmaking.\n\nSUMMER ART CAMPS\n2022\nElem, k-4/5th grades\nMTW, 9-noon\nJune 20, 21, 22\nJuly 11, 12, 13\nJuly 18, 19, 20\nAug 8, 9, 10\nAug 15, 16, 17\nAug 22, 23, 24\nAug 29, 30, 31\n\nTeen 5/6th-12th grades\nWThF, 2-5pm\nJune 22, 23, 24\nAug 3, 4, 5\nAug 10, 11, 12\nAug 17, 18, 19\nAug 24, 25, 26\nAug 31, Sept 1, 2",
    "images": []
  },
  {
    "title": "Art Literacy Academy",
    "link": "https://pdxparent.com/directory/art-literacy-academy-2/",
    "description": "Providing Art History based Fine Art lessons for young artists, with Saturday studio classes, and Summer Camps.\n\nFor more information, contact: Serene   sepia84@hotmail.com\n\nwww.artliteracyacademy.com",
    "images": []
  },
  {
    "title": "Speak and Be Heard Theater",
    "link": "https://pdxparent.com/directory/speak-and-be-heard-theater/",
    "description": "We are a theater company dedicated to bringing the joy of the theater to neurodiverse populations. We believe that everyone has a fundamental right to communicate and experience the world in a positive and meaningful way. Our camps and classes focus on teaching social skills, team work, and problem solving through the art of theater. Children gain valuable social skills and peer interactions through participating in our small group classes. Speak and Be Heard Theater is run by a certified Speech and Language Pathologist who has more than 14 years of experience working with neurodiverse populations including children with Autism, Down Syndrome, Intellectual Disabilities, and more.",
    "images": []
  },
  {
    "title": "Owl & Bee Clay Company",
    "address": "3506 NE 57th Ave, Portland, OR, USA",
    "link": "https://pdxparent.com/directory/owl-bee-clay-company/",
    "website": "http://Owlandbeeclaycompany.com",
    "description": "Come to Owl & Bee Clay Company for a creative experience. We offer after school clay classes, summer, winter and spring break art camps, clay birthday parties …and Adult Happy Hour too!",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/05/OwlBeeClayCo_logo.png"
    ]
  },
  {
    "title": "Concert School of Music",
    "link": "https://pdxparent.com/directory/concert-school-of-music/",
    "description": "Our goal at Concert School of Music is to provide high quality music instruction in a supportive environment. We strive to challenge each student to their fullest, while providing motivation to help them achieve their goals.\n\nWe offer private lessons on piano, guitar, voice, violin, viola, cello, double bass, clarinet, flute, recorder, saxophone, drums, composition, banjo, mandolin, & ukulele. We also offer group lessons including rock band, chamber groups, string orchestra, and more.",
    "images": []
  },
  {
    "title": "Benson Tech Youth Project Multi-Sport Athlete Camp",
    "link": "https://pdxparent.com/directory/benson-tech-youth-project-multi-sport-athlete-camp/",
    "description": "This camp is a great opportunity for kids to spend a week being involved in sports.  The camp is run by our Athletic Director and our coaching staff.  bensonathletics.net",
    "images": []
  },
  {
    "title": "Ekone Summer Camps",
    "address": "401 Ekone Road, Goldendale, WA, USA",
    "link": "https://pdxparent.com/directory/ekone-summer-camps/",
    "website": "http://www.ekone.org",
    "facebook": "https://www.facebook.com/ekoneranch",
    "description": "Since 1986, Ekone has been a home to children in the summertime.  At Ekone, campers experience being an important member of an inclusive community, in relationship and service to a place.  We believe that this experience is fundamental to our human nature, transformative for those who experience it, and essential to creating a viable, vibrant future on Earth. \n\nAnd fun!  If there's anything Ekone is known for, it's finding the fun in everything. \n\nDays at camp are spent almost entirely outside, with a community of 25-30 children aged 8-18, and a crew of 10-15 staff and mentors aged 16-80.  Together, we engage in play, work, skill-building, and activities designed to connect us to nature, each other, and ourselves.  We learn to listen closely to the birds.  We stalk the deer at the pond.  We create art from found objects.  We run wild through the woods.  We shed some of the busy-ness of modern life and remember how to make our own fun.\n\nWe also care for the needs of our place and community, taking responsibility for ourselves and our shared experience.  We cook meals, clean up after them, tend the garden, feed the animals, buck hay, haul firewood, and engage in conservation projects on the land.  We learn to listen to each other, speak our truth with kindness, and create the kind of community we want to live in.\n\nAnd we simply enjoy life on the ranch.  Campers sleep in the rustic A-frame bunkhouse or under the stars.  Our wholesome, delicious meals are cooked from scratch, and most of our produce is from Ekone's own garden.  We take a break from screens, mirrors, makeup, competition, and drama.  We swim in the pond, swing on the rope swings, catch frogs, and build forts. \n\n​This year we will be providing both Family Camps and some overnight camps for teens. Family Camps will provide day-camp style activities during the day for kids, with shared family meals and plenty of time together as well. ",
    "images": []
  },
  {
    "title": "NW FILM CAMP",
    "address": "4033 SW Canyon Rd, Portland, OR, USA",
    "link": "https://pdxparent.com/directory/nw-film-camp/",
    "website": "https://www.nwfilmcamp.com",
    "instagram": "https://www.instagram.com/cherrystreetfilms",
    "description": "Summer Filmmaking at the World Forestry Center Portland Starts August 2nd, 2021\n\nGet the kids out of the house, off the screens and behind the camera! Our project based, in-person and online programs are the perfect Summer activity for aspiring filmmakers and content creators. NW Film Camps provide 10:1 student/teacher ratio featuring personalized instruction and peer to peer learning in a supportive, inclusive, covid safe, social environment.\n\nNW FILM CAMP is proud to partner with the World Forestry Center at Washington Park this Summer!\n\nThis bucolic campus is also home to the Oregon Zoo, Hoyt Arboretum & Portland Japanese Garden.\nJoin us at Washington Park the Summer! NW Film Camp is located at 4033 SW Canyon Rd, Portland, OR 97221\n\nDay Camp: Monday through Friday - 8:30am - 3pm Starting at $350 a week. Students Ages 11 through 17 are encouraged to enroll. Limited Space - Enroll Today.\n\n-\n\nOur in person and online camps are fun and creative project based programs designed to teach teamwork and collaboration. Activities range from production planning, location scouting, hands on tech and gear tutorials, introduction to industry standards, screenwriting, project management and so much more. These young media creators work in small teams or independently to produce short films to share with their communities, and beyond! We will be following all CDC, state and local guidelines regarding Covid-19 to ensure that all campers remain safe & healthy this Summer.\n\nSAMPLE SCHEDULE\n8:30 - Drop off / Check in\n9:00 - Instruction / Pre-production\n10:30 - Onset Film Production\n12:00 - Lunch Break - Bring a lunch!\n12:30 - Team Building Outside\n12:45 - Continue Filming\n1:30 - Post-production work\n2:30 - Pick up - No later than 3:00pm",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2021/04/40849-1-scaled.jpg"
    ]
  },
  {
    "title": "Willamette Sailing Club",
    "address": "6336 S Beaver Ave, Portland, OR, USA",
    "link": "https://pdxparent.com/directory/willamette-sailing-club-2/",
    "website": "https://willamettesailingclub.com/learn-to-sail/",
    "facebook": "https://www.facebook.com/Willamettesailingclub/",
    "instagram": "https://www.instagram.com/willamettesailingclub/?hl=en",
    "description": "Portland's center for small boat sailing since 1961, Willamette Sailing Club is located on the banks of the Willamette River, approximately 5 minutes south of downtown. The club hosts learn-to-sail summer camps, classes and race teams taught by certified instructors, with over 500+ students coming through our program annually! We offer classes for every age and level of experience. Whatever your sailing interest is, WSC provides the opportunity to get out on the river and enjoy some family fun in a safe, welcoming and scenic environment.\n\nStudents learn the basics of small boat sailing through hands on learning and fun games that are designed to practice boat handling and water safety. All classes are taught by US Sailing certified instructors and follow the US Sailing beginner curriculum. 50-foot swim check with a life jacket required.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/02/2BB85CDF-4F81-4BEA-A614-A10C6A840233_1_105_c-1.jpeg"
    ]
  },
  {
    "title": "Sunnyside Mennonite Montessori School Preschool & Summer Camp",
    "address": "312 SE 35th Ave, Portland, OR",
    "link": "https://pdxparent.com/directory/sunnyside-mennonite-montessori-school-preschool-summer-camp/",
    "website": "https://www.smmspdx.com/",
    "instagram": "http://Www.instagram.com/sunnysidemennonitemontessorisc",
    "description": "Sunnyside Mennonite Montessori School is a small school in the heart of the Hawthorne neighborhood of Southeast Portland. We are committed to following the teaching methods of Maria Montessori, whose ideas were ahead-of-her time, but have stood the test of time. Throughout its history, SMMS has been committed to making high-quality early childhood education affordable. Through annual fundraising, and with generous sponsorship from Portland Mennonite Church, we are able to keep tuition costs low.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/04/Screenshot_20220421-163747_Canva.jpg"
    ]
  },
  {
    "title": "Cedarwood Waldorf School",
    "link": "https://pdxparent.com/directory/cedarwood-waldorf-school/",
    "description": "SUMMER CAMP REGISTRATION IS NOW OPEN!\nCedarwood is running camps for children age 3 - grade 8, June 21 - August 13\nRegister here: https://www.cedarwoodschool.org/break-summer-camps\nCedarwood students are curious and engaged critical thinkers and doers who care about creating a better world.\nChildren in pre-kindergarten through grade 8 are nurtured by a developmentally thoughtful pedagogy, with hands-on experiences both in the classroom and off-campus. Located just minutes from downtown Portland, Oregon, in the historic Lair Hill Neighborhood, Cedarwood Waldorf School’s curriculum weaves together the arts, academics, and movement to bring learning to life. From early childhood through the completion of eighth grade, our students are met with openness to possibility, given time to develop resiliency, and taught skills to turn challenges into opportunities.\nCedarwood Waldorf School has been helping children develop a richly well-rounded set of skills, creativity, inner strength and capability, and connection to community since 1997.",
    "images": []
  },
  {
    "title": "Oregon Space Camp Adventures",
    "link": "https://pdxparent.com/directory/oregon-space-camp-adventures/",
    "description": "Are you looking for a great STEM camp?\n\nOregon Space Camp Adventures organizes week long chaperone led trips to Space Camp in Huntsville, Alabama from Portland OR.\n\nFor more information check out our web page at:\n\nhttps://www.oregonspacecampadventures.org/",
    "images": []
  },
  {
    "title": "Independent Publishing Resource Center",
    "address": "Alder Commons, 4212 NE Prescott St, Portland, OR 97218, USA",
    "link": "https://pdxparent.com/directory/independent-publishing-resource-center/",
    "website": "https://www.iprc.org/education/show-tell-camp/",
    "facebook": "https://www.facebook.com/IPRCPDX",
    "instagram": "https://www.instagram.com/iprc_pdx/",
    "description": "IPRC Summer offerings are here! For youth programs this summer we’re partnering with Alder Commons to bring you after school camps that will take place rain or shine in their ample and dynamic outside spaces! We've got a full lineup with a variety of genres to explore: comics & zines for middle grades; printmaking basics for elementary and middle grades; and creative writing + printmaking for high schoolers. Our hope is that youth artists and writers come away feeling inspired to make art & writing for the rest of the summer! ",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2021/05/Showtell_Image.jpg"
    ]
  },
  {
    "title": "Art Literacy Academy",
    "link": "https://pdxparent.com/directory/art-literacy-academy/",
    "description": "Art Literacy Academy provides  after school enrichment programs , Saturday art classes and summer camps. Some lessons are now  available for parents and educators on the website/shop. The Art History based Art lessons for  young artists are step by step tutorials. The complete packages include a bio, facts about the artist, 3-5  lessons for each artist, and a Teacher's guide with links to additional resources. Sample lessons are available to view on the ALA website.\n\n www.artliteracyacademy.com\n\nFor further information about the in-person classes or summer camp please contact me through the website or at sepia84@hotmail.com. ",
    "images": []
  },
  {
    "title": "Anthony Newman Summer Sports Camps at Wilsonville Parks and Rec. Summer 2022!",
    "address": "29600 Park Place, Wilsonville, OR, USA",
    "link": "https://pdxparent.com/directory/anthony-newman-summer-sports-camps-at-wilsonville-parks-and-rec-summer-2022/",
    "website": "http://www.anthonynewmancamps.com",
    "facebook": "https://www.facebook.com/AnthonyNewmanCamps",
    "description": "Anthony Newman’s Sports Camps offers our very popular Multi-Sport Camp for young athletes who are not quite ready to focus on just one sport. A great introduction to the sports world whether you are experienced or new to sports, this camp will offer opportunities to experience all types of sports both conventional and non-conventional, i.e. basketball, soccer, football, softball, P.E. activities, games, coordination, agility and so much more! Anthony Newman’s Sports Camps is a great opportunity for children to discover the thrill of sports while making new friends in a fun, safe atmosphere.",
    "images": [
      "https://pdxparent.com/wp-content/uploads/2022/04/20210723_091015-scaled.jpg"
    ]
  },
  {
    "title": "Sauvie Island Center Farm Camp",
    "link": "https://pdxparent.com/directory/sauvie-island-center-farm-camp/",
    "description": "Join us on the farm for fun and exploration at Farm Camp.\n\nCome for spring break or spend a whole week exploring the farm in the farm this summer. At the Sauvie Island Center's Farm Camp children spend their days exploring beautiful  Topaz Farm, while soaking up the fresh air and learning about the natural world. Each day at camp is a new adventure as we investigate the science behind how our food grows.\n\nSpring break camp begins Tuesday, 3/22  and runs through Friday, 3/25.  Each day will offer a different theme. Campers can participate in a single day, or register for all four and receive a discount.\n\nDay 1: March 22 – Food Web Through food webs, all living things are interconnected. Students will gain an understanding of the food web (producers, consumers, and decomposers), and recognize that all living things get their energy from the sun.\n\nDay 2: March 23 – Plant Parts and Seed to Harvest Campers will learn about all six parts of the plant, including their function, how to identify each part, and which parts we eat on various plants. Through these lessons campers will learn about the life cycle of plants from seed to harvest!\n\nDay 3: March 24 – Soil and Compost Students investigate the four elements of healthy soil (water, air, organic materials, minerals), and meet the residents of a vermi-compost bin!\n\nDay 4: March 25 (Family Day): Dig in to all SIC curriculum topics and the interconnectedness of nature We will cover pieces of each of our lessons in the morning. After a lunch break we will spend the afternoon exploring the garden and creating garden-themed arts and crafts near by.\n\nSummer camp runs Monday, 7/18 - 7/22 and  again Monday, 7/25 - 7/29.  Through traditional camp activities—like games, camp songs, arts and crafts and more—we’ll focus on different parts of the Sauvie Island Center curriculum including:\n\nSoil Exploration: Dig in and learn about healthy soil.\nSeed to Harvest: Plant, tend and harvest the Grow Lunch Garden.\nPlant Parts Investigation: Explore the farm and plants we can eat.\nWildlife & Food Web: Who else has been foraging on the farm?\nPollination Station: Meet these hard-working farm friends.",
    "images": []
  },
  {
    "title": "Vibe of Portland",
    "link": "https://pdxparent.com/directory/vibe-of-portland/",
    "description": "Vibe of Portland is offering both half-day and full-day camps this summer, held in-person and with COVID-19 safety precautions. Vibe's summer camps encourage imaginative thinking and inspire your child to look at the world from new perspectives, through art! Campers learn a variety of techniques, hone their artistic skills, and develop friendships. Vibe offers a variety of subjects, from mixed media, illustration and drawing, environmental-based art, creating art from the world around us, and more! For music fans, Vibe is offering a musical theater camp for all levels, and a flute and clarinet camp for grades 6-10.\n\nVibe is an Art and Music educational nonprofit committed to ensuring equitable access to quality arts education experiences for long-term positive growth and is currently reimagining their in-person arts education offerings when all emerge from this global pandemic. They are fortunate to be able to offer in-person summer camps on sites with plenty of outdoor, and indoor space. Vibe's instructors are vaccinated, and masks are to be worn by all, teachers and students.",
    "images": []
  },
  {
    "title": "Circus Cascadia Summer Camp",
    "link": "https://pdxparent.com/directory/circus-cascadia-summer-camp/",
    "description": "Our camp allows children to get creative, move their bodies and have fun outdoors.  Many circus skills will be introduced in our beautiful Big Top.",
    "images": []
  },
  {
    "title": "Joy’s Art Studio",
    "link": "https://pdxparent.com/directory/joys-art-studio/",
    "description": "Fun in Hood River! Painting, drawing, watercolor, collage, and printmaking.\n\nSUMMER ART CAMPS\n2022\nElem, k-4/5th grades\nMTW, 9-noon\nJune 20, 21, 22\nJuly 11, 12, 13\nJuly 18, 19, 20\nAug 8, 9, 10\nAug 15, 16, 17\nAug 22, 23, 24\nAug 29, 30, 31\n\nTeen 5/6th-12th grades\nWThF, 2-5pm\nJune 22, 23, 24\nAug 3, 4, 5\nAug 10, 11, 12\nAug 17, 18, 19\nAug 24, 25, 26\nAug 31, Sept 1, 2",
    "images": []
  }
]
